[
    {
        "Job Title": "Full Stack Developer (APIs, Next.js, Node.js) - Part time",
        "Company": "PrimeRishta.com",
        "Location": "India (Remote)",
        "Job Type": "Part-Time",
        "About the Company": "Primerishta.com is a leading provider of online matchmaking services, along with ancillary services, while delivering matchmaking services to users in Canada, the USA, the UK & Australia. Primerishta.com has connected families from around the world in Sikh, Hindu, and Muslim communities and achieved a milestone of connecting 15000+ families.",
        "Job Overview": "We are looking for an experienced Full Stack Developer with strong expertise in API development, Next.js (frontend), and Node.js (backend) to join our team on a part-time basis. You will be responsible for developing and maintaining web applications, optimizing performance, and ensuring seamless integration between the frontend and backend systems.",
        "Work Schedule": {
            "Hours": "3 hours daily",
            "Days Off": "Alternate Saturdays & Sundays"
        },
        "Compensation": "Monthly salary (to be discussed after the interview)",
        "Key Responsibilities": [
            "Design, develop, and maintain APIs for web applications.",
            "Build and optimize scalable Next.js front-end components.",
            "Develop and maintain Node.js back-end services.",
            "Ensure high performance and responsiveness of applications.",
            "Collaborate with other developers, designers, and stakeholders to implement new features.",
            "Troubleshoot and debug issues across the stack.",
            "Maintain documentation for developed applications and APIs."
        ],
        "Required Skills & Experience": [
            "Strong experience in API development (RESTful & GraphQL).",
            "Proficiency in Next.js (React framework) for frontend development.",
            "Expertise in Node.js for backend development.",
            "Experience working with databases (SQL & NoSQL).",
            "Knowledge of authentication & authorization techniques (JWT, OAuth).",
            "Familiarity with cloud platforms & deployment strategies (AWS, Vercel, or similar).",
            "Experience with version control (Git, GitHub, or GitLab).",
            "Ability to work independently and meet deadlines in a remote environment."
        ],
        "Requirements added by the job poster": [
            "4+ years of work experience with API Development",
            "4+ years of work experience with Node.js",
            "4+ years of work experience with Next.js"
        ],
        "Nice to Have": [
            "Knowledge of UI/UX best practices.",
            "Experience with serverless functions.",
            "Familiarity with testing frameworks (Jest, Mocha)."
        ],
        "How to Apply": "If you're an experienced full-stack developer looking for a flexible, part-time opportunity, send your resume, portfolio."
    },
    {
        "Job Title": "Full Stack Python Developer",
        "Company": "MarsDevs",
        "Location": "Remote / Hybrid (India-based candidates preferred)",
        "Job Type": "Full-time",
        "Company Description": "MarsDevs is a remote-first, offshore digital product development company based in India. We specialize in building MVPs, Mobile and Web Applications, SaaS Products, and vertical solutions for SMBs. Our services include systematic project analysis, UI/UX design, technical consulting, deployment, maintenance, and digital marketing. With over 60 successful solutions delivered in 10 countries and 12 industry verticals, we prioritize quality, speed, and long-lasting technical architectures.",
        "Role Details": {
            "Position": "Full Stack Python Developer",
            "Experience": "2+ years",
            "Start Date": "Immediate preferred"
        },
        "What You'll Do": [
            "Develop robust backend systems using Python.",
            "Build and customize modules on Odoo and ERPNext platforms.",
            "Create dynamic frontends using React, JavaScript, and jQuery.",
            "Own the end-to-end deployment process of web applications.",
            "Collaborate using GitHub—merge requests, code reviews, and CI workflows.",
            "Write clean, scalable, and maintainable code across the stack."
        ],
        "What We're Looking For": [
            "2+ years of hands-on experience in full-stack development (Python-focused).",
            "Proven experience with Odoo and/or ERPNext (must-have).",
            "Proven experience with FastAPI",
            "Proficiency with React, JavaScript, and jQuery.",
            "Experience deploying applications independently to production environments.",
            "Deep familiarity with GitHub workflows and version control best practices."
        ],
        "Why MarsDevs?": [
            "Work directly with global founders and product teams",
            "Flexible work culture with high ownership",
            "Continuous learning environment with real impact"
        ]
    },
    {
        "Job Title": "Salesforce Full-Stack Developer - Billing and Revenue Recognition",
        "Company": "Expedite Commerce",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About the job": "Expedite Commerce is a Salesforce-native Lead-to-Cash SaaS platform offering advanced Digital Engagement, Configure, Price Quote (CPQ), Contract Lifecycle Management (CLM), eCommerce and Subscription Billing. We are accelerating growth through an AI-first approach, improving both customer experience and operational productivity.",
        "The Role": "As a Salesforce Full-Stack Developer, you will play a critical role as a technical expert and solution provider for our enterprise clients, focusing on creating and enhancing Salesforce applications while leveraging deep domain expertise in Billing and Revenue Recognition. You will ensure seamless workflows for SaaS, XaaS, and IoT billing models and revenue compliance (ASC 606), providing an outstanding user journey and technical experience.",
        "Domain Expertise": {
            "Billing": [
                "Demonstrate expertise in SaaS, XaaS, and IoT billing models, with a strong understanding of Recurring, Usage, and Consumption-based billing",
                "Possess knowledge of usage processing and its implications on billing accuracy and scalability"
            ],
            "Revenue Recognition": [
                "Exhibit deep understanding of ASC 606 standards and the ability to design accounting and financial workflows that comply with regulatory requirements",
                "Possess a working knowledge of accounting principles and their application to revenue recognition processes"
            ],
            "ERP Integration": [
                "Experience with integration to financial systems such as QuickBooks Online (QBO), SAP, and NetSuite to ensure seamless workflows and accurate financial reporting"
            ]
        },
        "What You Will Do": [
            "Design & develop robust Salesforce Apex classes/API's, along with microservices integrating advanced features including AI, building FrontEnd Application components. Focus will be upon the delivery of premium quality applications with high customer utilization & satisfaction ratings",
            "You will act as an individual contributor in areas including Frontend (Vue.js) & Backend (Apex) while working as part of the overall Development team",
            "Collaborate with cross-functional teams to thoroughly understand the broader business & technical requirements while communicating effectively with technical & non-technical stakeholders acting as a subject-matter expert",
            "Effectively utilize data analytics to enhance application functionality, performance, and optimize user experiences in current & subsequent releases",
            "Manage and optimize server interactions within Salesforce environments",
            "Follow security protocols and architecture, ensuring the protection of sensitive data and compliance with regulatory standards",
            "Support development and oversee CI/CD pipelines to ensure seamless deployment and continuous integration of new features and updates",
            "Stay updated with the latest advancements in Salesforce.com, AI tools including GitHub Copilot, and best practices in e-commerce technology application development"
        ],
        "Requirements": [
            "5+ years of experience development on the Salesforce.com platform utilizing synchronous & asynchronous apex",
            "3+ years of experience building applications using any Javascript framework, such as Angular/React/Vue.js",
            "2+ years of hands-on experience in Billing and Revenue Recognition workflows.",
            "Experience integrating Salesforce with financial systems such as NetSuite, SAP, or QuickBooks Online",
            "Demonstrated expertise in SaaS, XaaS, or IoT billing models, with a strong understanding of Recurring, Usage-based and One-time billing.",
            "Knowledge of ASC 606 standards and the ability to design workflows that meet regulatory requirements",
            "Proficiency in Salesforce development (LWC, Apex, Visualforce, Flow Builder) and modern development tools such as CI/CD pipelines and Git",
            "Strong understanding of financial workflows, including billing accuracy, scalability, and revenue compliance",
            "Exceptional written and verbal communication skills, with a customer-focused mindset",
            "Ability to prioritize effectively in a fast-paced environment while managing multiple tasks",
            "Extensive experience managing large data sets within billing and revenue recognition processes",
            "Strong analytical skills and problem-solving skills combined with ability to document & collaborate with both technical and non-technical stakeholders effectively using professional-level English",
            "Capabilities leveraging AI technologies to develop and deploy applications within Salesforce cloud environments",
            "Demonstrable capabilities implementing and managing APIs and microservices"
        ],
        "Preferred Skills and Requirements": [
            "Experience building Salesforce AppExchange solutions",
            "Experience with any billing or revenue recognition platforms like Salesforce Billing, Zuora, salesforce revenue cloud etc.",
            "Knowledge of AI tools and methodologies for process automation and workflow improvement"
        ],
        "Work Timings": "1 pm -10 pm IST",
        "Benefits": [
            "Health Insurance, PTO, and Leave time",
            "Ongoing paid professional training and certifications",
            "Fully Remote work Opportunity",
            "Strong Onboarding & Training program"
        ],
        "Why Join Us?": [
            "Creative Freedom: Define the visual identity of industry-leading products",
            "Growth Opportunities: Collaborate with senior leadership and a dynamic team",
            "Innovation-Focused: Push boundaries with AI-driven, cutting-edge designs"
        ],
        "About the company": "At Expedite Commerce, we're leading a transformative shift in revenue operations by embedding advanced AI into our cloud-based platform. Our AI-first solutions redefine the lead-to-cash process, enabling businesses to:\nAccelerate Growth: Harness AI to boost sales and expand market reach.\nOptimize Operations: Streamline processes with intelligent automation.\nEnhance Customer Engagement: Deliver personalized experiences that drive loyalty.\nWe envision a future where AI and human expertise collaborate seamlessly to unlock unprecedented business potential. Our suite includes AI-powered Configure-Price-Quote (CPQ), Contract Lifecycle Management (CLM), eCommerce, and Recurring Billing solutions.",
        "What Sets Us Apart": [
            "Deep AI Integration: Our platform utilizes an agent-based framework that acts on your behalf, adapting to your business processes to automate complex tasks.",
            "Market Leadership: Positioned at the forefront of the AI revolution in revenue operations.",
            "Proven Track Record: With a global client base and consistent growth, we've demonstrated our ability to deliver impactful results."
        ],
        "Who We Empower": [
            "Sales Operations: Free your sales team to focus on buyers by automating complex tasks.",
            "Marketing Operations: Leverage insights for more effective campaigns.",
            "Finance Operations: Optimize billing and revenue recognition with intelligent automation."
        ],
        "Industries We Serve": [
            "SaaS",
            "XaaS",
            "IoT",
            "Manufacturing",
            "Brands"
        ],
        "Our Global Footprint": "We support customers in over 50 countries with a team of 60 experts and 150 partner resources.",
        "Join Our Mission": "We're on a mission to reshape the future of commerce through AI innovation. Whether you're seeking new growth avenues or looking to make a significant impact, Expedite Commerce offers an exciting path forward."
    },
    {
        "Job Title": "Full-stack Developer",
        "Hiring Partner": "Uplers",
        "Client": "Serenity",
        "Location": "Remote",
        "Job Type": "Full-time Permanent position",
        "Experience": "2+ years",
        "Salary": "INR 3000000-6000000 / year (based on experience)",
        "Expected Notice Period": "30 Days",
        "Shift": "(GMT+05:30) Asia/Kolkata (IST)",
        "About the Client and Opportunity": "Serenity is Looking for: Seeking a skilled Full-stack Developer to join our team in building cutting-edge blockchain solutions for secure data storage and security. As a Full-stack Developer, you will be a key contributor to both front-end and back-end development, seamlessly integrating blockchain technologies to deliver scalable, secure, and user-friendly platforms. These platforms will meet the demands of the modern digital landscape and set new industry standards for privacy and asset management.",
        "Must have skills required": [
            "CI/CD",
            "Nft",
            "Rust",
            "Web3auth",
            "Blockchain",
            "dapps",
            "Smart Contract",
            "web3.js",
            "Docker",
            "Solidity"
        ],
        "Responsibilities": [
            "Design and develop responsive front-end interfaces using modern JavaScript frameworks.",
            "Build and maintain back-end APIs and services to support DApp functionality.",
            "Write, test, and deploy smart contracts on the EVM-compatible blockchains.",
            "Ensure the security and performance of applications through rigorous testing and optimization.",
            "Collaborate with cross-functional teams to define, design, and ship new features.",
            "Participate in code reviews and maintain high-quality coding standards.",
            "Developing intuitive and responsive user interfaces that facilitate seamless interaction with blockchain-based systems.",
            "Integrating cutting-edge cryptographic protocols and privacy-enhancing techniques into the core infrastructure.",
            "Collaborating with a multidisciplinary team of engineers, cryptographers, and designers to push the boundaries of blockchain technology.",
            "Staying abreast of emerging trends and advancements in the blockchain and privacy domains."
        ],
        "Required Skills": [
            "Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).",
            "A deep understanding of blockchain architecture, consensus mechanisms, and smart contract development.",
            "Proven experience as a Full-stack Developer or similar role.",
            "Proficiency in multiple programming languages, including Solidity, JavaScript, Python and front-end frameworks (e.g., React, Vue.js, or Angular).",
            "Strong back-end development skills with Node.js and familiarity with Express or similar frameworks.",
            "Experience with blockchain development, including Rust (for CosmWasm on Secret Network) and/or Solidity (for EVM chains).",
            "Knowledge of Web3 libraries (e.g., Web3.js, ethers.js, CosmJS) for blockchain integration.",
            "Understanding of security best practices in web and blockchain development.",
            "Excellent problem-solving skills and attention to detail."
        ],
        "Preferred Skills": [
            "Experience with various blockchain ecosystems for development.",
            "Familiarity with decentralized identity solutions (e.g., Web3Auth) and NFT implementation.",
            "Knowledge of DevOps practices, such as CI/CD pipelines and containerization (e.g., Docker).",
            "Prior work on privacy-focused or data storage applications."
        ],
        "Interview Process": [
            "Technical Round 1",
            "Assessment",
            "Technical Round 2"
        ],
        "How to apply for this opportunity?": "Step 1: Click On Apply! And Register or Login on our portal. Step 2: Complete the Screening Form & Upload updated Resume Step 3: Increase your chances to get shortlisted & meet the client for the Interview!",
        "About Uplers": "Our goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement. (Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well). So, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!"
    },
    {
        "Job Title": "Full Stack Developer (Java + React)",
        "Company": "GigaTech Services",
        "Location": "India (Remote)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About the Job": {
            "Role": "Full Stack Developer (Java + React)",
            "Role Type": "Remote",
            "Location": "India",
            "Description": "Own features end-to-end with React + Material UI frontend and Spring Boot backend. Emphasize clean code, testing, and security."
        },
        "Tech Stack": [
            "React",
            "Material UI",
            "Java 17",
            "Spring Boot",
            "PostgreSQL",
            "OAuth2",
            "Cognito"
        ],
        "Role Responsibilities": [
            "Develop user-friendly web applications using Java and React.",
            "Design and maintain RESTful APIs for seamless communication between front-end and back-end systems.",
            "Collaborate with UX/UI designers to implement visually appealing designs into functional applications.",
            "Write clean, maintainable, and efficient code following best practices.",
            "Perform unit testing to ensure code quality and functionality.",
            "Participate in code reviews to uphold coding standards and improve code quality.",
            "Work closely with cross-functional teams to understand project requirements and deliver effective solutions.",
            "Conduct troubleshooting and debugging of applications to resolve issues promptly.",
            "Stay updated with emerging technologies and industry trends to enhance development processes.",
            "Implement responsive design principles for optimal performance on various devices.",
            "Manage databases, ensuring data integrity and security.",
            "Create and maintain technical documentation for reference and training purposes.",
            "Contribute to the planning and prioritization of features and bug fixes.",
            "Engage in Agile development processes, participating in daily stand-ups and sprint planning.",
            "Support deployment processes and provide post-deployment maintenance as needed."
        ],
        "Qualifications": [
            "Bachelor's degree in Computer Science or related field.",
            "Proven experience as a Full Stack Developer or similar role.",
            "Strong proficiency in Java and React.",
            "Experience with RESTful API development.",
            "Familiarity with relational and NoSQL databases.",
            "Knowledge of version control systems such as Git.",
            "Understanding of Agile development methodologies.",
            "Excellent problem-solving and analytical skills.",
            "Ability to work independently and collaboratively in a remote environment.",
            "Strong communication skills, both verbal and written.",
            "Experience with frontend technologies such as HTML, CSS, and JavaScript.",
            "Understanding of cloud services (AWS, Azure, etc.) is a plus.",
            "Continuous learning mindset to keep up with industry changes.",
            "Experience in unit testing frameworks (JUnit, Jest, etc.).",
            "Demonstrated ability to deliver complex projects on time."
        ],
        "Skills": [
            "PostgreSQL",
            "Agile Development Methodologies",
            "Git",
            "Unit Testing Frameworks (JUnit, Jest)",
            "Cloud Services (AWS, Azure)",
            "Material UI",
            "UI/UX Design",
            "OAuth2",
            "React",
            "Unit Testing",
            "Problem Solving",
            "HTML",
            "Cognito",
            "Spring Boot",
            "Java",
            "RESTful APIs",
            "RESTful API Development",
            "Database Management",
            "Springboot",
            "Agile Methodologies",
            "CSS",
            "JavaScript",
            "Version Control"
        ],
        "About the Company": "GigaTech Services is an IT Services and IT Consulting company providing complete IT solutions."
    },
    {
        "Job Title": "Full Stack Developer Intern (React + Node.js)",
        "Company": "Zeus Artificial Intelligence",
        "Location": "On Site (Ahmedabad, Gujarat, India)",
        "Type": "Paid Internship",
        "Duration": "3 Months",
        "About the job": "We're looking for Full Stack Developer Interns to join our team for a 3-month paid internship working on live company projects. This is a great opportunity to gain real-world experience and potentially transition into a full-time role based on performance.",
        "Requirements": [
            "Strong knowledge of React, Node.js, and Express.js",
            "Experience with SQL and MongoDB databases",
            "Understanding of web development tools such as Git & GitHub (version control), Postman (API testing), and a Basic understanding of RESTful APIs, debugging, and deployment",
            "Ability to work independently on real-time projects (this internship is for practical experience, not training)"
        ],
        "What you'll get": [
            "Work on actual company products, not dummy tasks",
            "Opportunity to learn in a professional environment",
            "Stipend provided",
            "Possibility of a full-time job offer at the end of the internship"
        ],
        "Application Method": "Fill this form to apply: https://forms.gle/LGsh8XGRA8CvcfoM7",
        "About the company": "Zeus Artificial Intelligence provides advanced cloud services for analysis monitoring and tracking in real time."
    },
    {
        "Job Title": "Senior Full-Stack Engineer - AI & Growth Automation",
        "Company": "LTV.ai",
        "Location": "Remote (APAC)",
        "Type": "Full-time",
        "Level": "Mid-Senior level",
        "About the Role": "At LTV.ai, we're redefining customer engagement for e-commerce brands by empowering them with their own AI-powered ambassadors to deliver hyper-personalized Email and SMS interactions at an unprecedented scale.\n\nOur platform enables brands to communicate with their audience in a natural and contextually relevant manner, driving higher engagement and conversion rates. While increasing LTV and driving measurable growth, we help brands stay focused on what matters most—the customer.",
        "Why join us?": "We're a fast-moving team building a high-growth company that's transforming the e-commerce industry. As an early team member, you'll play a key role in shaping both our product and the future of e-commerce, with the opportunity to grow alongside us.",
        "What We'd Like to Work On": [
            "Refining our AI infrastructure to enable deeper segmentation, optimize customer-level memory, and integrate advanced agentic workflows for greater adaptability and efficiency",
            "Enhancing our AI conversation engine to deliver self-optimizing interactions that gather actionable feedback, helping brands better understand their customers.",
            "Expanding self-service capabilities to provide smaller brands on our waitlist—and across the industry—seamless access to the LTV.ai platform"
        ],
        "Our Stack": {
            "Frontend": "React (TypeScript)",
            "Backend": "NestJS (TypeScript)",
            "Infrastructure": "AWS managed with Terraform",
            "Databases": "PostgreSQL & ClickHouse"
        },
        "What We're Looking For (Ideally)": [
            "6+ years of experience in our stack",
            "2+ years of experience in our industry (ecommerce / email marketing)",
            "Excitement about using AI coding tools to increase productivity (e.g. Cursor, Windsurf, Copilot)"
        ],
        "Requirements added by the job poster": [
            "4+ years of work experience with TypeScript",
            "4+ years of work experience with Databases",
            "4+ years of work experience with React.js"
        ],
        "Compensation + Benefits": "Competitive compensation, equity, and a commitment to your personal and professional growth."
    },
    {
        "Job Title": "Senior Full-stack .NET Developer",
        "Company Name": "Enqcode Technologies LLP",
        "Location": "Ahmedabad, Gujarat, India",
        "Work Model": "On-site",
        "Job Type": "Full-time",
        "Company Overview": "Enqcode Technologies is a dynamic and innovative tech company specializing in cutting-edge solutions for various industries. We are seeking an experienced software developer to join our team and contribute to our exciting projects.",
        "Job Description Summary": "We are looking for a passionate Full-stack (.NET + Angular) Developer with 4 years of experience to join our team in Ahmedabad. The ideal candidate should have a strong background in back-end development. Experience with React, Azure, or AWS is a plus.",
        "Minimum Experience": "4 years",
        "Key Responsibilities": [
            "Design, develop, and maintain software applications using Angular, .NET Core, and ASP .NET MVC (all must).",
            "Collaborate with cross-functional teams, including other developers, designers, and product managers, to deliver high-quality solutions.",
            "Write clean, efficient, and maintainable code.",
            "Optimize applications for performance, scalability, and security.",
            "Troubleshoot and debug technical issues, providing effective and timely solutions.",
            "Keep up-to-date with industry trends and emerging technologies to enhance your skills and contribute to team success."
        ],
        "Qualifications": [
            "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
            "Minimum of 4 years of professional experience as a Software Engineer.",
            "Strong proficiency in Angular, NgRx, PrimeNG, Tailwind, RxJS, TypeScript, .NET Core, ASP .NET MVC, with a demonstrable track record of successful projects.",
            "Can do pixel-perfect design using Angular.",
            "Experience with RESTful APIs and web services.",
            "Familiarity with version control systems (e.g., Git).",
            "Strong problem-solving skills and a commitment to delivering high-quality code.",
            "Excellent communication and teamwork abilities.",
            "A passion for coding, a commitment to staying current with emerging technologies, and a strong aptitude for learning.",
            "Understanding of agile development methodologies."
        ],
        "Good to Have": [
            "Experience with cloud platforms (e.g., AWS, Azure, or Google Cloud).",
            "Knowledge of DevOps practices and CI/CD pipelines.",
            "Familiarity with containerization and orchestration tools (e.g., Docker, Kubernetes)."
        ],
        "Working Days and Hours": "Monday to Friday, 10 am to 7 pm",
        "How to Apply": {
            "instructions": "Interested candidates can apply by sending their resume to connect@enqcode.com.",
            "email": "connect@enqcode.com",
            "subject": "Application for Full-stack .NET Developer"
        }
    },
    {
        "Job Title": "Full Stack WordPress Developer",
        "Company": "DazzleBirds Web Solutions",
        "Location": "Remote",
        "Experience": "2-4 years",
        "Working time": "Mon-Fri 10 am to 7 pm",
        "Job Type": "Full-time",
        "Position Overview": "We are seeking a skilled Full Stack Developer with a primary focus on WordPress development to join our dynamic team. The ideal candidate will have extensive experience in backend customizations, including theme and plugin development, API integrations, custom API creation, payment gateway integrations, and WooCommerce customization. Knowledge of modern frontend technologies and frameworks is also essential, with experience in React.js and Node.js considered a strong advantage.",
        "Key Responsibilities": [
            "Create and customize WordPress themes and plugins to meet client-specific needs.",
            "Build and integrate custom APIs, including REST API.",
            "Perform advanced WooCommerce customizations for e-commerce functionality.",
            "Implement custom payment gateway integrations.",
            "Develop scalable and secure backend solutions using WordPress and related technologies.",
            "Troubleshoot and debug WordPress issues.",
            "Create responsive and user-friendly designs using page builders and custom JavaScript.",
            "Ensure seamless UI/UX for all projects.",
            "Integrate external APIs and develop custom endpoints for WordPress.",
            "Optimize and maintain API performance.",
            "Utilize React.js and Node.js for custom application development and integration where needed."
        ],
        "Qualifications and Skills": [
            "Proficiency in WordPress development, including theme/plugin creation and customization.",
            "Strong knowledge of PHP, MySQL, and WordPress core concepts.",
            "Expertise in API integration and creation, with a focus on performance and security.",
            "Experience with custom payment gateway integration and WooCommerce customization.",
            "Hands-on experience with modern frontend technologies:",
            "Knowledge of React.js and Node.js (preferred).",
            "Familiarity with HTML5, CSS3, and JavaScript.",
            "Experience with page builders like Elementor, WPBakery, Divi or similar.",
            "Solid understanding of web performance optimization and security best practices.",
            "Strong debugging and problem-solving skills.",
            "Ability to work collaboratively in a team environment."
        ],
        "Preferred Qualifications": [
            "Experience with headless WordPress using React.js and GraphQL.",
            "Knowledge of Git and version control systems.",
            "Familiarity with deployment processes and server management."
        ],
        "Benefits": [
            "Competitive salary based on experience.",
            "Flexible working hours and remote work opportunities.",
            "Professional growth.",
            "Collaborative and inclusive team culture."
        ],
        "Application Process": "Please share your resume with hr@dazzlebirds.com"
    },
    {
        "Job Title": "Full Stack Developer - .Net/Angular",
        "Company": "TechExtensor",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level (3 to 6 Years)",
        "About the Company": "TechExtensor is a leading ISO 9001:2015 Certified Web and Mobile App Development Company based in Ahmadabad, India catering Globally. We excel in industry-focused software development solutions and consulting services across multiple industries. Empowered by 14 years of excellence, the company has been delivering unmatched solutions across multiple business domains, such as Healthcare, E-learning, Finance, Banking, E-commerce, Media, Logistics, Real Estate, IoT, and more. We believe in delivering substantial business value on every client engagement by combining industry-specific business expertise and technical skill with an innovative technology and business-driven professional firm. As part of our commitment to our customers, we provide them with support throughout their journey toward digital transformation. With a large team of professionals specializing in different industries, we can better understand the organization's challenges. We provide them with solutions and services that are flexible and efficient.",
        "About the Job": "Tech Extensor is looking for a skilled and enthusiastic Full Stack Developer with strong expertise in .NET and Angular to join our growing team! If you're passionate about building scalable web applications and comfortable engaging in client interactions, interviews, and technical discussions, we'd love to connect with you.",
        "What You'll Do": [
            "Build, test, and maintain web applications using Angular (10+) for front-end and .NET (Framework/Core) for back-end.",
            "Design and develop scalable RESTful APIs and ensure seamless integration with front-end components.",
            "Collaborate with cross-functional teams to gather requirements and deliver solutions that align with business goals.",
            "Optimize applications for performance, scalability, and maintainability.",
            "Participate in code reviews, testing (unit & integration), and ensure adherence to best practices.",
            "Take an active role in technical discussions and client interactions."
        ],
        "Skills & Qualifications": [
            "3 to 5 years of proven experience in full stack development.",
            "Strong knowledge of Angular, RxJS, and component-based architecture.",
            "Hands-on experience with .NET Framework/Core, C#, ASP.NET MVC/Web API.",
            "Proficient in SQL Server, writing complex queries, and performance optimization.",
            "Solid understanding of HTML5, CSS3, JavaScript, and TypeScript.",
            "Familiarity with Entity Framework and REST API development.",
            "Experience with Agile methodologies and a good grasp of the SDLC.",
            "Excellent communication skills for effective client-facing roles."
        ],
        "Good to Have": [
            "Exposure to Azure/AWS cloud platforms.",
            "Understanding of DevOps tools, CI/CD pipelines, Docker, or Kubernetes.",
            "Experience with testing tools like NUnit, Jasmine, or Karma.",
            "Familiarity with Git, microservices architecture, and patterns like CQRS, Event-Driven Architecture."
        ],
        "Commitments": [
            "Career growth and learning: We are committed to giving our employees a continuous opportunity to grow in their careers."
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "Motorola Solutions",
        "Location": "India (Remote)",
        "Type": "Full-time",
        "Level": "Mid-Senior level",
        "Position Type": "Experienced",
        "About the job": {
            "Company Overview": "At Motorola Solutions, we believe that everything starts with our people. We're a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that's critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.",
            "Department Overview": "Our IT organization has a critical role in driving extraordinary business results. Through a strong partnership with other areas of our business, we bring innovative thinking to every conversation and deliver with integrity. We're looking for people who bring great ideas and who make our partners' ideas better. Intellectually curious advisors (not order takers) who focus on outcomes to creatively solve business problems. People who not only embrace change, but who accelerate it.",
            "Job Description": "As a Workplace Technologies Software Engineer you will be part of an agile DevOps team. You will support maintenance of existing tools, incubate and develop new tools, and automate/augment functionality of off-the-shelf products to remove any friction for users to collaborate, connect, and communicate effectively."
        },
        "Scope of Responsibilities / Expectations": [
            "Design, develop, and maintain user friendly web and mobile applications.",
            "Create and integrate RESTful APIs for seamless communication between front-end and backend systems.",
            "Document features, APIs, and workflows to enhance team knowledge sharing.",
            "Collaborate with cross-functional teams to gather requirements and translate them into technical solutions."
        ],
        "Desired Background/Knowledge/Skills": [
            "Expertise in developing hybrid mobile applications using Ionic framework.",
            "Experience with developing Google Chrome Extension and web apps.",
            "Hands-on experience with programming languages like Angular, TypeScript, PHP, JAVA.",
            "Understanding of security best practices in web and mobile application development.",
            "Hands-on experience with cloud platforms like AWS or GCP.",
            "Familiarity with build pipelines and CI/CD tools such as Jenkins.",
            "Familiarity with tools like Jira, Confluence, Bitbucket, Android Studio, and Xcode.",
            "Able to keep up your technical know-how and via research, online learning and/or rapid prototyping.",
            "Proactive approach and enthusiasm for problem identification and solving.",
            "Strong interpersonal skills.",
            "Flexible and able to adapt to changing priorities."
        ],
        "Basic Requirements": [
            "Bachelor's degree in Computer Science or related field with 3+ years of experience.",
            "Experience with front-end development using Javascript, HTML, and CSS.",
            "Experience with backend development using Node.js, Python.",
            "Experience with SQL databases and designs."
        ],
        "Travel Requirements": "null",
        "Relocation Provided": "null",
        "Referral Payment Plan": "No",
        "EEO Statement": "Motorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\n\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you'd like to join our team but feel that you don't quite meet all of the preferred skills, we'd still love to hear why you think you'd be a great addition to our team.\n\nWe're committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please email ohr@motorolasolutions.com."
    },
    {
        "Job Title": "Full Stack Developer - MERN Stack Technologies",
        "Company": "Hidden Brains InfoTech",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About the Company": "Hidden Brains InfoTech is CMMI Level 3 Enterprise Software Development & IT Consulting Company with a focus on digital transformation. Started in 2003, Hidden Brains has grown at an exponential pace with more than 2400 clients across 107 countries. We are ‘Great Place to Work® Certified, highlighting our work culture and transparent practices.\n\nWe offer unique solutions that empower clients right from startups, digital agencies to large enterprises to grow.\n\nOur excellence lies in building technology solutions to create an intelligent enterprise with an aim to innovate and accelerate.",
        "Job Overview": "We are looking for an experienced Full Stack Developer with expertise in the MERN (MongoDB / MySQL, Express.js, React, and Node.js) stack to join our dynamic team. The ideal candidate will have a proven track record of building and deploying robust web applications, a solid understanding of both frontend and backend technologies, and a passion for delivering high-quality, scalable solutions.",
        "Key Responsibilities": [
            "Design, develop, test, and deploy scalable web applications using the MERN stack.",
            "Work collaboratively with cross-functional teams to define, design, and implement new features.",
            "Write clean, maintainable, and efficient code following best practices and coding standards.",
            "Optimize applications for maximum performance, scalability, and security.",
            "Troubleshoot, debug, and resolve issues and bugs across the stack.",
            "Participate in code reviews, contribute to technical documentation, and mentor junior developers as needed.",
            "Stay updated with emerging trends and technologies in web development, particularly within the MERN ecosystem."
        ],
        "Technical Skills": {
            "Frontend": [
                "React",
                "Next.Js",
                "React Hooks",
                "Redux",
                "component-driven architecture"
            ],
            "Backend": [
                "Node.js",
                "Nest.js",
                "Express.js",
                "building RESTful APIs",
                "using middleware"
            ],
            "Database": [
                "MongoDB",
                "MySQL",
                "schema design",
                "indexing",
                "aggregation",
                "query optimization"
            ],
            "Version Control": [
                "Git",
                "collaborative workflows (e.g., Gitflow)"
            ],
            "Deployment & DevOps": [
                "cloud services like AWS, Azure, or DigitalOcean",
                "CI/CD pipelines"
            ],
            "Other Tools/Technologies": [
                "HTML5",
                "CSS3",
                "JavaScript (ES6+)",
                "JSON",
                "WebSockets",
                "testing frameworks such as Mocha, Chai, or Jest"
            ]
        },
        "Qualifications": [
            "Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).",
            "5+ years of experience in full-stack development, with a strong focus on MERN stack.",
            "Demonstrated experience in delivering end-to-end projects in an Agile environment.",
            "Strong problem-solving skills and attention to detail.",
            "Excellent communication skills and a team-oriented mindset."
        ],
        "Preferred Qualifications (Added Advantage)": [
            "Knowledge of additional frameworks or libraries such as Next.js, GraphQL, or TypeScript.",
            "Experience with microservices architecture and containerization tools like Docker and Kubernetes.",
            "Familiarity with serverless architectures and NoSQL databases beyond MongoDB."
        ]
    },
    {
        "Job Title": "Full Stack Developer - Java/React.js",
        "Company": "AIXTOR Technologies",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Employment Type": "Full Time",
        "Experience Level": "Mid-Senior level",
        "About the Company": "At Aixtor, we are passionate about transforming enterprises with innovative digital solutions that drive success. As a proud Liferay Silver Partner, we specialize in delivering top-tier tailored enterprise solutions that enhance business operations and customer experiences.",
        "About the Role": "The ideal candidate has experience building products across the stack and a firm understanding of web frameworks, APIs, databases, and multiple back-end languages.\n\nThe full stack developer will join a small team that uses new technology to solve challenges for both the front-end and back-end architecture, ultimately delivering amazing experiences for global users.",
        "Industry Type": "IT Services & Consulting",
        "Department": "Delivery",
        "Responsibilities": [
            "Develop and maintain web applications using React JS, Node JS.",
            "Design, implement, and manage databases using SQL Server, MySQL, or PostgreSQL.",
            "Write clean, maintainable, and efficient code.",
            "Architect, design, and build end-to-end optimize applications for maximum speed and scalability.",
            "Participate in all aspects of agile software development, including design, implementation, and deployment",
            "Collaborate with cross-functional teams to define, design, and ship new features.",
            "Participate in code reviews to maintain code quality and share knowledge.",
            "Troubleshoot, debug, and upgrade existing applications.",
            "Stay up to date with the latest industry trends and technologies.",
            "Collaborate across time zones via Skype, Teams, GitHub comments, documents, and frequent video meetings"
        ],
        "Requirements": [
            "4-6 years of experience as a Sr. Full Stack Developer.",
            "Excellent knowledge of front-end web programming languages, such as ReactJS, HTML, CSS, JavaScript or JQuery, with ability to render server-side and client-side content.",
            "They must have good knowledge of at least two backend frameworks, such as NodeJS, Spring, or Express.js, as well as at least one backend language, such as Java, or Python of the back-end technologies.",
            "Familiarity with common programming design patterns and best practices.",
            "Experience in designing and integrating RESTful APIs and must know about databases, and server configuration.",
            "Database and cache: Knowledge of DBMS systems, such as SQL Server, MySQL, PostgreSQL, Oracle, or MongoDB and as well as caching technologies like Redis, Memcached.",
            "Knowledge about validation, responsiveness, and user experience is a must.",
            "Excellent debugging and optimization skills.",
            "Experience in unit/integration testing.",
            "At least one year of experience in building large-scale web-based software applications.",
            "Experience with common web development tools and services, such as code version and control software, package managers like SVN, GIT, or BitBucket.",
            "Good to have hands on experience working with CI/CD pipelines.",
            "Excellent written and verbal communication skills.",
            "Strong attention to detail and problem-solving skills.",
            "Bachelor's degree in computer science, engineering, or a related technical field."
        ],
        "Key Skills Frontend": [
            "NodeJS",
            "ReactJS",
            "JQuery or JavaScript"
        ],
        "Key Skills Backend": [
            "NodeJS",
            "Java or Spring"
        ]
    },
    {
        "Job Title": "Full Stack Developer (Web application / AI) – Contract",
        "Location": "Remote",
        "About the Role": "We're partnering with an early-stage founder to build an MVP-level web application that will test product-market fit in a fast-moving space. We're looking for a Full Stack Developer with deep experience in modern frontend and backend technologies and a strong understanding of integrating AI APIs. This role requires a self-starter who can work autonomously and deliver quality, scalable code with minimal oversight. You'll be the technical cornerstone of the MVP build, collaborating closely with the product lead and design resources to bring early-stage ideas to life.",
        "What You'll Do": [
            "Own the end-to-end development of a market-ready MVP",
            "Build responsive, performant user interfaces using React, Next.js, and TypeScript",
            "Design and maintain backend logic with PostgreSQL (preferred) and Node.js",
            "Integrate AI APIs such as OpenAI or Google Gemini into the application",
            "Implement secure, scalable, and testable codebases",
            "Work autonomously with high ownership and reliability",
            "Deliver rapid prototypes using tools like Global or Data Button (optional)",
            "Participate in async communication with stakeholders and provide timely updates"
        ],
        "Ideal Candidate": [
            "5+ years of full-stack development experience, ideally with startups or MVP-stage products",
            "Expert in React, Next.js, and TypeScript",
            "Strong backend experience, particularly with PostgreSQL (bonus if you also know MongoDB)",
            "Proven experience working with AI APIs (e.g., OpenAI, Gemini)",
            "Solid understanding of responsive web design and cross-device compatibility",
            "Familiar with rapid development and iteration cycles",
            "Able to work independently, self-manage priorities, and hit deadlines",
            "Excellent English communication skills, both written and spoken",
            "Comfortable working across time zones with at least 4–6 hours of overlap with EST"
        ],
        "What You'll Get": [
            "Flexible working hours with async-friendly communication",
            "Direct access to product decision-makers",
            "Opportunity to shape the technical foundation of a new product from the ground up"
        ],
        "How to Apply": [
            "Your resume/CV",
            "GitHub or code samples",
            "Links to relevant projects (if available)",
            "A brief note about your availability and region",
            "Your salary expectations"
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "DotProduct Solutions",
        "Location": "Remote, India",
        "Job Type": "Full-time",
        "Openings": 3,
        "Eligibility Criteria": "B.Tech/M.Tech graduate with 2 years of relevant work experience. A waiver on experience may be considered if you can showcase strong personal projects.",
        "About the Role": "We are looking for a Full Stack Developer proficient in Angular/React and Django to join our team. Your primary focus will be developing user interface components and backend APIs, ensuring the application is robust, scalable, and maintainable. You will collaborate with a cross-functional team working across various layers of the infrastructure.",
        "Responsibilities": [
            "Develop new user-facing features using Angular/React.",
            "Build reusable components and front-end libraries for future use.",
            "Translate designs and wireframes into high-quality code.",
            "Optimize components for responsiveness and performance across different devices and browsers.",
            "Implement security measures and data protection.",
            "Integrate data storage solutions, including PostgreSQL, AWS S3, and Azure."
        ],
        "Expected Skill Set": [
            "Proficiency in Python, with experience in at least one Python web framework.",
            "Strong knowledge of TypeScript, including DOM manipulation and the JavaScript object model.",
            "Familiarity with ORM (Object Relational Mapper) libraries.",
            "Deep understanding of Angular and its core principles.",
            "Experience with popular Angular workflows.",
            "Strong knowledge of RESTful APIs.",
            "Understanding of modern authentication mechanisms (e.g., JSON Web Tokens).",
            "Familiarity with modern front-end build tools such as Babel, Webpack, and NPM.",
            "Experience with Git and AWS."
        ],
        "Why Join DotProduct": "Work in an environment that fosters creative freedom and leadership in project execution. Gain exposure to cutting-edge R&D activities across various domains. Engage with innovative projects built from the ground up.",
        "Selection Process": [
            "Apply via LinkedIn, ensuring your portfolio is linked to your resume.",
            "Shortlisted candidates will undergo a technical assessment.",
            "Based on the assessment performance, selected candidates will proceed to further interview rounds."
        ],
        "About the company": "At DotProduct, we engineer real-time solutions to real business problems. Our team of product engineers help businesses make decisions faster by eliminating performance bottlenecks. The solutions we build are capable of tackling complex data quickly and efficiently thereby helping businesses and startups increase profitability and streamline operations. We don't simply build products, we build products that can outperform industry standards. We are a full-stack product development company founded in 2019. We have worked on projects ranging from MVPs to large-scale enterprises primarily for the Fintech and Real-estate sectors."
    },
    {
        "Job Title": "Full Stack Web Developer",
        "Company": "Harris Global Business Services (GBS)",
        "Location": "India (Remote)",
        "Type": "Full-time",
        "Level": "Mid-Senior level",
        "About the Company": "Global Business Services (GBS) is the Harris Center of Excellence for Global Offshoring. We provide an efficient, turn-key solution for business units across the CSI ecosystem to access qualified, global talent while promoting diversity and encouraging innovation.\n\nHarris Computer, an operating group of Constellation Software, Inc. (CSI), acquires, manages, and builds mission critical software solutions all over the world to serve the needs of healthcare, utilities, local government, education, public safety, and numerous other vertical markets.",
        "About the job": {
            "Primary Functions": [
                "Design, develop, and maintain web applications using ASP.NET MVC, C#, and SQL Server.",
                "Build responsive applications using HTML5, CSS3, JavaScript, and Bootstrap.",
                "Develop, consume, and document RESTful APIs.",
                "Collaborate with product managers, QA engineers, and fellow developers in an Agile environment.",
                "Participate in code reviews, sprint planning, and DevOps processes.",
                "Utilize Bitbucket for source control, Jira for task tracking, and Azure DevOps for builds and deployments.",
                "(Optional) Support basic database maintenance and tuning tasks.",
                "(Highly desirable) Experience working on clinical or healthcare applications."
            ]
        },
        "Job Qualifications": {
            "Minimum Qualifications": [
                "Bachelor's degree in computer science, Engineering, or related field (or equivalent experience).",
                "3-5 years professional development experience with ASP.NET MVC, C#, and SQL Server.",
                "3-5 years' experience using Bootstrap for responsive UI development.",
                "Proficient in Agile methodologies and DevOps workflows using Bitbucket, Jira, and Azure DevOps."
            ],
            "Additional Qualifications": [
                "(Nice to have) Knowledge of modern frontend libraries (e.g., React, Angular, Vue).",
                "(Bonus) Exposure to basic DBA concepts such as indexing and query tuning."
            ],
            "Soft/ Behavior Skills": [
                "Good Communication and Collaboration.",
                "Strong ARO",
                "Ability to work both independently and as part of a team",
                "Strong analytical and creative problem-solving skills"
            ]
        }
    },
    {
        "Job Title": "Senior Full Stack Developer (ReactJS + .NET)",
        "Company": "BairesDev",
        "Location": "Remote Work",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About BairesDev": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.\nOur diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.\nWhen you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.",
        "About the Role": "We are looking for a Senior Full Stack Developer with expertise in ReactJS and .NET to join our team. This role involves developing and maintaining web applications, collaborating with cross-functional teams, and ensuring code quality and best practices. The ideal candidate will have strong problem-solving skills and a proven track record in full stack development.",
        "What You'll Do": [
            "Design and develop web applications using ReactJS and .NET C# WebAPI.",
            "Write clean, maintainable, and well-documented code following best practices.",
            "Collaborate with team members to deliver high-quality software solutions.",
            "Participate in code reviews to ensure code quality and standards.",
            "Mentor junior developers and provide technical guidance.",
            "Troubleshoot and debug applications to optimize performance.",
            "Stay updated with emerging technologies and industry trend."
        ],
        "What we are looking for": [
            "5+ years of experience with ReactJS and .NET C# development.",
            "Strong understanding of best practices, such as SOLID and clean code, focusing on scalable solutions.",
            "Extensive experience with code reviews, writing automated tests, and implementing CI/CD pipelines.",
            "Strong expertise in unit testing, integration testing, and maintaining high code coverage.",
            "Demonstrated ability to make informed technical decisions and apply the best approach for each use case.",
            "IT infrastructure knowledge.",
            "Advanced level of English."
        ],
        "How we make your work (and your life) easier": [
            "100% remote work (from anywhere).",
            "Excellent compensation in USD or your local currency if preferred.",
            "Hardware and software setup for you to work from home.",
            "Flexible hours: create your own schedule.",
            "Paid parental leaves, vacations, and national holidays.",
            "Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.",
            "Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities."
        ]
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Type": "Full-time, Contractual",
        "Experience Level": "Entry to Expert",
        "About the Job": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes).",
            "Note: Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        ],
        "About the Company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers by working with leading AI labs to advance frontier model capabilities and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications."
    },
    {
        "Job Title": "Senior Full Stack Developer (ReactJS + .NET C# WebAPI)",
        "Company": "BairesDev",
        "Location": "Remote Work",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About the job": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley. Our diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide. When you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.",
        "Specific Role": "Senior Full Stack Developer (ReactJS + .NET C# WebAPI) at BairesDev",
        "Role Description": "We are seeking a highly skilled and experienced Full-Stack Tech Lead Developer to join our dynamic team. The ideal candidate will have a strong background in software development and at least 10 years of professional experience, particularly with hands-on coding in ReactJS and .NET C# WebAPI. This role requires an individual who demonstrates excellent technical leadership, a high degree of ownership, and an ability to communicate effectively across all levels of the organization.",
        "Responsibilities": [
            "Lead the design and development of high-quality software solutions using ReactJS and .NET C# WebAPI.",
            "Architect, design, and maintain applications using .NET MVC, ReactJS, and other relevant technologies.",
            "Integrate with Microsoft Azure services such as Azure SQL, Azure AD, WebApp, ApiApp, Azure Storage, EventHub, Stream Analytics, Application Insights, and others.",
            "Design and implement REST APIs ensuring proper architecture and scalability.",
            "Lead smaller project teams and mentor junior developers.",
            "Conduct thorough code reviews and enforce coding standards and best practices."
        ],
        "Requirements": [
            "Bachelor's or Master's degree in Computer Science, Information Technology, or related field.",
            "10+ years of experience in software development with ReactJS and .NET C# WebAPI.",
            "Demonstrated experience in leading technical teams and mentoring developers.",
            "Proficient in .NET languages (C#) and frameworks, enabling the creation and implementation of highly scalable web, mobile, and desktop software applications.",
            "Proficient in Microsoft Azure services (Azure SQL, Azure AD, WebApp, ApiApp, Storage, EventHub, Stream Analytics) and Service Bus technologies.",
            "Strong expertise in REST API design, architecture, implementation, and integration.",
            "Experience with ADO DevOps control systems.",
            "Advanced knowledge of front-end technologies including jQuery, jQuery UI, and Kendo UI.",
            "Experience with Node.js and SignalR.",
            "Advanced level of English."
        ],
        "Benefits": [
            "100% remote work (from anywhere).",
            "Excellent compensation in USD or your local currency if preferred",
            "Hardware and software setup for you to work from home.",
            "Flexible hours: create your own schedule.",
            "Paid parental leaves, vacations, and national holidays.",
            "Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.",
            "Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities."
        ],
        "Call to Action": "Apply now and become part of a global team where your unique talents can truly thrive!"
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "SupplyHouse",
        "Location": "Remote (Must be located in India and able to verify right to work within the country)",
        "Job Type": "Full-Time, Permanent",
        "Level": "Associate",
        "Schedule": "Standard business hours are Monday through Friday from 8:00 a.m. to 5:00 p.m. ET. Employees located outside of the United States work a schedule with a minimum of 4-5 hours per day that overlap with our standard business hours to ensure effective collaboration.",
        "Salary": "$23,500 - $29,000 USD per year",
        "About the job": "SupplyHouse.com, through an Employer of Record (EOR), is looking for a talented and team-oriented Full Stack Developer based in India to join our team. In this position, you'll have the opportunity to work on impactful projects that enhance our e-commerce platform and internal operations, while honing your skills across front- and back-end development. If you're passionate about creating user-friendly interfaces, building scalable systems, and contributing to innovative solutions in a collaborative and fun environment, we'd love to hear from you!",
        "Responsibilities": [
            "Collaborate with cross-functional teams to gather and refine requirements, ensuring alignment with business needs.",
            "Design, develop, test, deploy, and maintain scalable, high-performance software applications.",
            "Create user-friendly and responsive front-end functionalities for our e-commerce platform while supporting robust back-end APIs and services.",
            "Develop and enhance internal tools and applications to improve company operations.",
            "Ensure system reliability, optimize application performance, and implement best practices for scalability.",
            "Design and implement reusable, maintainable UI components and templates.",
            "Work closely with Designers to ensure technical feasibility and adherence to UI/UX design standards.",
            "Manage and update promotional banners and site-wide templates to ensure timely execution of marketing initiatives.",
            "Continuously improve existing codebases, conducting code reviews, and implementing modern practices.",
            "Stay up to date with emerging technologies, trends, and best practices in full-stack development."
        ],
        "Requirements": {
            "Education": "Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.",
            "Experience": "3+ years of hands-on experience in full-stack development with a proven track record of delivering high-quality software.",
            "Front-End Skills": [
                "Proficiency in HTML5, CSS3, JavaScript (ES6+), and responsive design principles.",
                "Expertise in modern JavaScript frameworks and libraries such as React, Angular, or Vue.js.",
                "Experience with cross-browser compatibility and performance optimization techniques."
            ],
            "Back-End Skills": [
                "Proficiency in Java and experience with back-end frameworks like Spring Boot.",
                "Strong understanding of database design, RDBMS concepts, and experience with SQL.",
                "Knowledge of RESTful API design and integration."
            ],
            "Development Lifecycle": "Proven ability to contribute across the entire software development lifecycle, including planning, design, coding, testing, deployment, and maintenance.",
            "Tools & Practices": [
                "Familiarity with version control systems, like Git, and CI/CD pipelines.",
                "Experience with agile development methodologies."
            ],
            "Additional Skills": [
                "Strong problem-solving and debugging capabilities.",
                "Ability to create reusable code libraries and write clean, maintainable code.",
                "Strong communication and collaboration skills to work effectively within a team and across departments.",
                "High-level proficiency of written and verbal communication in English"
            ]
        },
        "What's important to us": [
            "Positive Attitude – All SupplyHouse.com employees, regardless of team or location, work together to serve our customers. We pride ourselves on fostering a dynamic culture where we encourage all ideas and listen to our customers to help consistently improve our business.",
            "GRIT – Led by our core values of Generosity, Respect, Innovation, Teamwork, and Grit, we're dedicated to maintaining a supportive work environment that celebrates diversity, embraces inclusivity, and empowers everyone to reach their full potential.",
            "Having Fun – We love team building events, guest speakers, skill development workshops, group celebrations, and company sponsored activities.",
            "Diversity and Inclusion – We promote a welcoming work environment and encourage individuals of all backgrounds to find community at our ‘House."
        ],
        "Why work with us": [
            "We have awesome benefits – We offer 100% company-paid medical insurance for you and your loved ones, privileged and sick leave, paid holidays, competitive Provident Fund contributions, Employee Assistance Program, and more!",
            "We promote work-life balance – We value your time and encourage a healthy separation between your professional and personal life to feel refreshed and recharged. Look out for our wellness initiatives!",
            "We support growth – We strive to innovate every day. In an exciting and evolving industry, we provide tremendous potential for career growth through our hands-on training, DE&I initiatives, opportunities for internal mobility, and professional development reimbursement budget.",
            "We give back – We live and breathe our core value, generosity, by giving back to the trades and organizations around the world. We make a difference through donation drives, employee-nominated contributions, support for DE&I organizations, and more.",
            "We listen – We value hearing from our employees. Everyone has a voice, and we encourage you to use it! We actively elicit feedback through our monthly town halls, regular 1:1 check-ins, and company-wide ideas form to incorporate suggestions and ensure our team enjoys coming to work every day."
        ],
        "Additional Information": "As part of the hiring process, thorough background checks will be conducted on all potential employees according to applicable laws and regulations."
    },
    {
        "Job Title": "Full Stack Web Developer",
        "Company Name": "TM Systems",
        "Location": "Ahmedabad, Gujarat, India (On-site / Work From Office)",
        "Job Type": "Full-time",
        "Experience": "3-5 Years",
        "No of Positions": "1",
        "Key Responsibilities": [
            "Design, develop, and maintain web applications using .NET Core and modern JavaScript frameworks.",
            "Apply Repository and CQRS patterns for clean and maintainable architecture.",
            "Write clean, maintainable, and efficient code.",
            "Utilise PostgreSQL for database design, management, and optimization.",
            "Debug and resolve software defects and issues.",
            "Perform code reviews to ensure code quality and best practices.",
            "Collaborate with cross-functional teams to translate business requirements into technical solutions.",
            "Stay updated with industry trends and best practices."
        ],
        "Required Skills": [
            "Strong proficiency in .NET Core (C#).",
            "Good understanding of Repository Pattern and CQRS Pattern.",
            "Proficiency in Entity Framework Core and ORM techniques",
            "Proficiency in Object-Oriented Programming (OOP) concepts.",
            "Hands-on experience with MySQL and PostgreSQL.",
            "Excellent problem-solving and debugging skills.",
            "Ability to work effectively in a collaborative team environment.",
            "Strong communication and interpersonal skills.",
            "A passion for learning and staying up-to-date with emerging technologies."
        ],
        "Nice to Have": [
            "Experience with frontend frameworks:",
            "Angular 16+",
            "React.js with Next.js or similar SSR frameworks",
            "Knowledge of Unit Testing and Integration Testing.",
            "Knowledge of web security best practices.",
            "Familiarity with version control systems (e.g., Git).",
            "Experience with cloud platforms (e.g., Azure, AWS).",
            "Experience with AI Tools (e.g., Claude, Chatgpt)."
        ],
        "Application Process": "Apply Now by writing to us at jobs@tmspl.com and be a part of our journey to simplifying technology.",
        "About the company": "TM Systems is an Information Technology consulting firm specializing in Cloud Migration, Product Development, Serverless Technology, Software Development, Cybersecurity & Location-based services.\nThe primary focuses of the company are all tied to one core value -simplifying information technology, product development, cybersecurity and location-based services for our customers.\nAlong with software development services, we are focused on providing security consulting services and protecting our client's data. We prioritize security threats and aid our clients to spot, prevent, and reduce risk in the most cost-effective way possible.\nOur goal is to become global leaders in security consulting services and location-based analytics along with software development."
    },
    {
        "job_title": "Java Full Stack Developer (React JS)",
        "company": "TribolaTech Inc",
        "location": "Remote",
        "job_type": "Full-time",
        "experience_level": "Mid-Senior level",
        "experience_range": "7 to 10 years",
        "about_company": "Founded in 2009, TribolaTech specializes in providing Information Technology Solutions and Outsourcing Services. Our executive teams have over 5 decades of combined experience in IT Consulting, Data Management and Staff Augmentation. We love technology and are proud to build a world class global company.\n\nTribolaTech is committed to delivering quality solutions that provide exceptional value, innovation, assurance, and integrity to our customers. With deep industry and business process expertise, comprehensive resources and a proven track record, TribolaTech can mobilize the right people, process and technologies to help clients improve their business.",
        "job_description_summary": [
            "Good hands-on experience in Java, Spring boot, Microservices",
            "Good experience in React JS framework who should be able to develop from scratch",
            "Should have the ability to develop a component library in React JS",
            "Recent project should be in React JS",
            "Good have UX Design",
            "Good experience in various databases: Postgre SQL, MySQL, Oracle, SQL Server",
            "Strong in core Java"
        ],
        "qualifications": [
            "7+ years of work experience with Java",
            "5+ years of work experience with Spring Boot",
            "2+ years of work experience with React.js"
        ]
    },
    {
        "Job Title": "Senior Java Full Stack Developer",
        "Company": "DRC Systems",
        "Location": "GIFT city, Gandhinagar (On-site)",
        "Job Type": "Full-Time",
        "Experience Required": "5 to 6 years",
        "Job Summary": "We are looking for a highly skilled and experienced Senior Java Full Stack Developer with a strong background in enterprise application development, microservices, and container orchestration platforms. The ideal candidate will have deep knowledge of Java 17, Spring Boot 3.x, JSF (Jakarta 4.x & JSF 1.2), PrimeFaces 13, Vaadin, and container-based deployment using Kubernetes. Experience with a variety of web and application servers, as well as modern relational databases, is essential.",
        "Key Responsibilities": [
            "Design, develop, and maintain scalable and secure Java EE / Spring Boot applications.",
            "Lead migration and integration projects involving legacy technologies (Struts, EJB, JSF 1.2) to modern stacks (Spring Boot, Jakarta JSF 4.x).",
            "Implement UI components using JSF, PrimeFaces 13, and Vaadin.",
            "Develop and maintain RESTful microservices.",
            "Deploy and manage applications on Kubernetes and application servers like JBoss, Tomcat, WildFly.",
            "Work with relational databases including MySQL and PostgreSQL.",
            "Ensure high performance and responsiveness of applications.",
            "Troubleshoot and resolve technical issues across multiple environments.",
            "Collaborate with cross-functional teams in an Agile/Scrum environment."
        ],
        "Required Skills and Experience": [
            "Minimum 5 years of professional experience in software development.",
            "Expertise in J2EE, Spring Boot 3.4.5, Java 17.",
            "Strong hands-on experience with JSF 1.2 and Jakarta Faces 4.x.",
            "Proficient in PrimeFaces 13 and Vaadin.",
            "Solid understanding of microservice architecture and implementation.",
            "Experience with Kubernetes for container orchestration.",
            "Hands-on experience with Apache2, JBoss, Tomcat, and WildFly servers.",
            "Strong database experience with MySQL and PostgreSQL.",
            "Good understanding of legacy frameworks such as Struts and EJB.",
            "Proficiency with JSF-Primefaces integration and component-driven development."
        ],
        "Qualifications": [
            "4+ years of work experience with Java"
        ],
        "About the Company": "DRC Systems India Limited (A CMMi3 Company) has established itself as a prominent figure in the software development industry. Our journey commenced in 2012 with modest resources and a small team of technology enthusiasts. Over the past decade, we have expanded significantly, now boasting a team of over 300 professionals across three office locations.\n\nOur headquarters is strategically positioned in GIFT City, Gandhinagar, offering unparalleled opportunities, exposure to growth, and access to world-class infrastructure.\n\nWe take pride in our diverse team of experts specialising in various technological domains, enabling us to consistently deliver high-quality solutions to our clients on schedule. Our comprehensive range of IT services includes Learning Management Systems (LMS), Blockchain, AI, Analytics, Automation, Cloud Solutions, Digital Transformation, Mobile and Web applications development and more.\n\nAt DRC Systems, we prioritise building lasting technology partnerships with our clients rather than just providing one-time solutions. Our clientele spans institutions, enterprises, government agencies, international brands, industry leaders, and start-ups alike."
    },
    {
        "Job Title": "MERN Full Stack Developer (Medior/Senior)",
        "Company": "Cruit",
        "Location": "Remote (Gujarat, India is mentioned as a base, but role is Remote)",
        "Type": "Full-time",
        "About the Company": "At Cruit, we're redefining how companies hire—by turning employees and communities into the most powerful recruiting engine. Our referral software helps teams hire faster and smarter. Backed by top Dutch investors, we're entering a phase of rapid growth and are looking for experienced engineers to help shape what comes next.\n\nCruit is an employee referral software designed to craft highly engaging programs that optimize referral recruitment, boost visibility and increase employee retention. With its app, Cruit empowers large Enterprise & mid-market companies to tap into the power of their employees' networks, enabling them to access high-quality candidates who align with their culture and goals.",
        "About the Role": "We're hiring a Full Stack Developer (5+ years experience) who thrives in fast-paced environments and takes full ownership of their work. This is a hands-on role—ideal for someone who's ready to make technical decisions, ship features end-to-end, and move fast without needing a lot of guidance.\n\nYou'll work on both the backend and frontend of our product, with a strong focus on building integrations with external systems like ATS platforms. We're already using AI to streamline these processes, and we expect you to be excited about applying AI in real-world workflows.",
        "What You'll Do": [
            "Build and improve core product features using Node.js, React, TypeScript, and MongoDB",
            "Develop and maintain integrations with third-party systems (especially ATS platforms)",
            "Own full feature lifecycles—from technical design to implementation and deployment",
            "Work closely with product and design teams to deliver a polished user experience",
            "Influence architectural decisions as we scale the product"
        ],
        "What You Bring": [
            "5+ years of full stack experience in modern JavaScript/TypeScript (Node.js + React)",
            "Solid understanding of MongoDB and RESTful APIs",
            "Ability to work independently and deliver production-ready code",
            "Familiarity with AI-enhanced coding tools (e.g., Cursor, Windsurf, GitHub Copilot)",
            "Interest in how AI is shaping product development—and ideas for where to take it"
        ],
        "Nice to Haves": [
            "Experience with HR tech or ATS integrations",
            "Hands-on use of AI APIs or embedded AI product features",
            "Product-minded: you care about UX, edge cases, and what actually helps users"
        ],
        "Perks": [
            "Health care provided",
            "IT equipment (laptop + monitor) included",
            "Work remotely or from our Ahmedabad office (coming soon)",
            "Learning & development budget to grow your skills"
        ],
        "Application Process": "Apply now via Cruit Europe: https://dub.sh/nLd701q"
    },
    {
        "Job Title": "Full Stack Developer",
        "Company Name": "Distinction Dev",
        "Location": "Ahmedabad, Gujarat, India",
        "Work Arrangement": "Hybrid - 3 days a week in office",
        "Job Type": "Full-time",
        "Experience Level": "Entry level",
        "Minimum Experience Required": "1.5+ years",
        "About the Company": "We make software that makes business sense.",
        "Ideal Candidate": [
            "Strong proficiency with JavaScript and NodeJs, along with java frameworks.",
            "Solid understanding of data structures and algorithms.",
            "Good Knowledge of AWS services",
            "Knowledge of front-end languages and libraries, including HTML, CSS, VueJs or ReactJs.",
            "Familiarity ReactNative is a plus.",
            "Previous experience/knowledge with cloud platforms, particularly AWS is advantageous.",
            "Excellent problem-solving skills and attention to detail.",
            "Candidate must be willing to relocate to Ahmedabad GJ, with reasonable notice."
        ],
        "Must Have Technical Capabilities": [
            "AWS/Serverless",
            "Javascript",
            "Typescript",
            "Java / Spring boot",
            "NodeJs",
            "NPM Packages",
            "Github/Gitlab"
        ],
        "Essential Job Functions & Duties": [
            "Collaborate with the Team to design and develop robust backend systems that facilitate data exchange and integration between various applications.",
            "Build and maintain serverless architectures, leveraging AWS Lambda and other relevant services, to ensure efficient and scalable solutions.",
            "Developing and deploying user interface for frontend website.",
            "Candidate should be able to write and understand code bases written in Java / Sprint Boot framework.",
            "Write well-structured, efficient, and maintainable code in TS and JS.",
            "Experience with browser-based debugging and performance testing software.",
            "Develop and maintain RESTful APIs for seamless communication between systems.",
            "Work closely with the CI/CD pipelines to ensure smooth deployment and continuous integration of backend components.",
            "Troubleshoot, debug, and resolve frontend + backend related issues, ensuring optimal system performance."
        ],
        "Other Responsibilities": [
            "Stay up-to-date with the latest trends and best practices in development and cloud technologies, particularly AWS.",
            "Contribute to the overall architecture and design decisions of the integration systems."
        ],
        "Educational Background": {
            "Preferred": "Bachelors of Technology in Computer Science",
            "Alternative Acceptable": "BS/MS in Computer Science"
        },
        "Benefits": [
            "Hybrid Working Culture",
            "Amazing Perks & Medical Benefits",
            "5 Days Working",
            "Mentorship programs & Certification Courses",
            "Flexible work arrangements",
            "Free drinks fridge and snacks",
            "Competitive Salary & recognitions"
        ]
    },
    {
        "Job Title": "Full Stack Developer (.Netcore & Angular)",
        "Company": "Orion Innovation",
        "Location": "Remote (Based in India - Kochi, Chennai, Coimbatore mentioned initially; Role locations specified as Kochi, Coimbatore)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level (5+ years)",
        "About Company": "Orion Innovation is a premier, award-winning, global business and technology services firm. Orion delivers game-changing business transformation and product development rooted in digital strategy, experience design, and engineering, with a unique combination of agility, scale, and maturity. We work with a wide range of clients across many industries including financial services, professional services, telecommunications and media, consumer products, automotive, industrial automation, professional sports and entertainment, life sciences, ecommerce, and education.",
        "Job Overview": "We are seeking a talented and motivated .NET- Full Stack Developer to join our dynamic development team. In this role, you will work on designing, developing, and maintaining software applications using the .NET framework, focusing on both front-end and back-end development. You will collaborate with cross-functional teams to create efficient, scalable, and high-performing software solutions.",
        "Key Responsibilities": [
            "Write clean, maintainable, and Code",
            "Understand best coding practices and adhere them to ensure code quality, security, organization and reusability",
            "Supporting and fixing existing functionality",
            "Collaborate with other developers, and stakeholders in the process of designing and development",
            "Candidates should be a self-motivated, independent and responsible team-player.",
            "Design, Develop and maintain application",
            "Lead and mentor a team of junior developers",
            "Strong problem-solving skills and ability to work independently"
        ],
        "Key Skills": [
            "Must have 3+ years of experience in .NET Core 8 and Angular 6+",
            "Efficient in C#, Entity Framework, .Net Core, Web API, SQL and ADO.Net.",
            "Experience in using Dependency injection pattern and IoC containers preferably Unity",
            "Writing tests with XUnit / NUnit",
            "Good Experience with Application Development",
            "Good at Backend development Backend Web Development",
            "Azure PAAS- Good to have"
        ],
        "Preferred Qualifications": [
            "Bachelor's degree in Computer Science, Engineering, or a related field."
        ],
        "What We Provide": [
            "Competitive Salary",
            "Performance based Variable Pay",
            "Health, Vision, Dental, and Life Insurance",
            "Comprehensive Employee Wellness Plan",
            "Retirement plan",
            "Paid Holidays and Vacation Time Accrual",
            "Encouraging and highly energetic environment",
            "Personal and Professional Growth Opportunities"
        ]
    },
    {
        "Job Title": "Sr Full Stack Developer (Angular-RoR)",
        "Company": "US based IT Product Company (Recruited by Seventh Contact Hiring Solutions)",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Seniority Level": "Mid-Senior level",
        "Experience": "7-10 yrs",
        "About the Position": "Seeking a seasoned engineer with a passion for changing the way millions of people save energy. Work within the Engineering team to build and improve platforms to deliver flexible and creative solutions to utility partners and end users. Seeking a skilled and passionate Fullstack Developer with expertise in Angular and RoR to join the development team. Responsible for contributing to Frontend & Backend systems in a global scaled agile model. Coordinate with the rest of the team working on different layers of the infrastructure. Commitment to collaborative problem solving, sophisticated design, and quality product is important. Own the development and its quality independently and be responsible for high quality deliverables. Work with a great team with excellent benefits.",
        "Responsibilities & Skills": [
            "Be excited to work with talented, committed people in a fast-paced environment.",
            "Be designing, building, and maintaining high performance responsive Web Applications and dashboards with reusable, and reliable code",
            "Use a rigorous approach for product improvement and customer satisfaction.",
            "Love developing great software as a seasoned product engineer.",
            "Have a strong eye for detail and quality of code.",
            "Have an agile mindset"
        ],
        "Required Skills": [
            "Experienced developer – ideally have 7 or more years of professional experience on complex applications.",
            "5+ years of experience in Angular",
            "3+ years of Ruby/Python experience, preferably Ruby (Ruby 3 or higher & Rails 6 or higher).",
            "Good understanding of Rails/Django framework, its core principles with an understanding of the Core and Internals.",
            "Good understanding of Docker/K8s stack.",
            "Experienced in Git and Continuous deployment.",
            "Experience in writing SQL queries - joins, query optimization, etc.",
            "Experience in developing APIs to industry-accepted RESTful standards.",
            "Must possess an aptitude for quick learning and the ability to work autonomously.",
            "Demonstrable experience with writing unit and functional tests using libraries like Rspec.",
            "A knack for benchmarking and optimization.",
            "Ability to understand product requirements and translate them into technical requirements"
        ],
        "Qualifications": [
            "Bachelor's or Master's degree in Computer Science, Engineering, or a related field."
        ]
    },
    {
        "Job Title": "Full Stack Developer & AI Engineer Internship",
        "Company": "Vegah LLC",
        "Location": "Remote (Partial IST & US CST hours)",
        "Type": "Part-time",
        "Duration": "1-2 years",
        "About Us": "Vegah LLC is a leading IT consulting firm specializing in digital transformations, cloud services, and AI/ML application development. We're seeking innovative undergraduate students ready to leverage cutting-edge AI tools for rapid application development.",
        "Internship Overview": "We're looking for tech-savvy interns who can utilize AI-powered development tools to build high-quality SaaS applications rapidly and independently. This role offers hands-on experience with generative AI coding assistants and modern development frameworks.",
        "Key Responsibilities": [
            "Rapidly prototype and develop end-to-end SaaS applications using AI-assisted coding tools",
            "Design and implement appealing UI/UX within tight timeframes",
            "Build and integrate AI-driven features, including chatbots and content generation",
            "Leverage vibe coding tools (Lovable, Cursor, Windsurf, Bolt, Replit) to accelerate development cycles in a fast-paced environment",
            "Contribute to projects involving web development leveraging various opensource ML models",
            "Deliver full applications independently within compressed timeframes (2-3 hours)"
        ],
        "Qualifications": [
            "Currently enrolled in Computer Science, Information Technology, or related undergraduate program",
            "Experience using AI coding assistants to generate high-quality code rapidly",
            "Portfolio demonstrating rapid SaaS application development",
            "Proficiency in both frontend (Angular, React) and backend technologies",
            "Strong UI/UX design sensibilities and experience with AI-powered design tools",
            "Familiarity with LLMs and foundational AI models",
            "Experience integrating AI features into web applications",
            "Ability to work independently and deliver complete projects efficiently",
            "Ability to work on cloud platforms, Azure, GCP, AWS etc.",
            "2+ years of work experience with GitHub",
            "Can start immediately",
            "1+ years of work experience with WordPress"
        ],
        "Required Skills": [
            "Amazon Web Services (AWS)",
            "Angular",
            "AngularJS",
            "Full-Stack Development",
            "HTML",
            "HTML5",
            "JavaScript",
            "React.js",
            "Software Development",
            "Web Applications"
        ],
        "What We Offer": [
            "Opportunity to pioneer AI-augmented development methodologies",
            "Mentorship from industry professionals",
            "Exposure to cutting-edge AI technologies",
            "Potential for future employment based on performance"
        ],
        "Important Note": "This is NOT a standard academic internship for resume padding. If you're only looking to add a brand logo to your CV without genuine passion and commitment, please look elsewhere. This opportunity is specifically designed for dedicated individuals willing to invest their time and demonstrate tangible value to our organization. The internship begins with a 1-2 month unpaid probation period during which you'll have the opportunity to prove your capabilities, followed by a paid position for those who demonstrate exceptional skills and commitment. We're seeking innovators who view this as a career investment rather than just an academic requirement.",
        "How to Apply": "Submit your resume, brief cover letter, and examples of SaaS applications you've built using AI-powered tools. Please complete our questionnaire highlighting your experience with rapid development using AI assistants."
    },
    {
        "Job Title": "Senior Java Full Stack Developer with AWS and Python",
        "Company": "Luxoft",
        "Location": "India (Remote)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "Notice Period": "ASAP",
        "About the Job": "We are seeking an experienced Java Developer to join our team in delivering high-performance applications that support our risk technology functions.",
        "Responsibilities": [
            "Develop, maintain, and enhance new and existing applications using Java.",
            "Build scalable and efficient solutions, ensuring performance optimization and smooth user interaction.",
            "Work closely with cross-functional teams to design, code, test, and debug applications in a collaborative environment.",
            "Apply best practices in software development, including object-oriented design principles, data structures, and algorithm optimization.",
            "Manage and optimize applications running on various platforms, including Unix, ensuring reliable and efficient performance.",
            "Utilize SQL databases for managing, retrieving, and organizing data efficiently within the applications.",
            "Ensure effective use of version control systems (e.g., Git, Bitbucket) for smooth project collaboration and code management.",
            "Support CI/CD pipelines to streamline development processes, including testing and deployment automation.",
            "Engage in troubleshooting, bug fixing, and enhancing code quality, ensuring stable production environments.",
            "Collaborate with risk technology teams to deliver solutions that meet business requirements while maintaining high technical standards."
        ],
        "Mandatory Skills": [
            "8 to 9 years of experience as a Java Full Stack developer",
            "Essential experience in Java, Spring, and Spring Boot",
            "Working knowledge of cloud-related technologies, preferably AWS, with 1 to 2 Years of experience",
            "Knowledge of Docker / Container orchestration (Swarm / Kubernetes, etc) is preferred.",
            "Knowledge of Java Multithreading and collections is preferred",
            "Scripting skills - Python",
            "Understanding of SQL databases for application development and data management",
            "Understanding of algorithms, data structures, and object-oriented design principles",
            "Firsthand experience with Python scripting for various automation and development tasks",
            "Experience using version control systems like Git and Bitbucket",
            "Familiarity with issue tracking and project management tools such as Jira, Bamboo, JIRA, GIT, Confluence, etc",
            "Strong debugging, troubleshooting, and performance-tuning skills.",
            "Excellent problem-solving abilities and a collaborative mindset",
            "Effective communication skills, with the ability to work closely with stakeholders and technical teams"
        ],
        "Nice-to-Have Skills": [
            "Bash/Linux",
            "Banking Domain"
        ],
        "Languages": {
            "English": "C2 Proficient"
        },
        "About the Company": "Luxoft, a DXC Technology Company (NYSE: DXC), is a digital strategy and software engineering firm providing bespoke technology solutions that drive business change for customers the world over. Acquired by U.S. company DXC Technology in 2019, Luxoft is a global operation in 44 cities and 21 countries with an international, agile workforce of nearly 18,000 people. It combines a unique blend of engineering excellence and deep industry expertise, helping over 425 global clients innovate in the areas of automotive, financial services, travel and hospitality, healthcare, life sciences, media and telecommunications. DXC Technology is a leading Fortune 500 IT services company which helps global companies run their mission critical systems. Together, DXC and Luxoft offer a differentiated customer-value proposition for digital transformation by combining Luxoft's front-end digital capabilities with DXC's expertise in IT modernization and integration."
    },
    {
        "Job Title": "Full Stack Developer(NextJS/Fastjs) - Remote (for Uplers' Client, Steer Health)",
        "Company": "Uplers (Hiring for client Steer Health)",
        "Location": "Remote (India)",
        "Job Type": "Full-time, Mid-Senior level",
        "Experience": "3+ years",
        "Salary": "USD 18,000 - 30,000 / year (based on experience)",
        "Expected Notice Period": "15 Days",
        "Shift": "(GMT+05:30) Asia/Kolkata (IST) - 10 AM-7 PM IST",
        "Engagement Model": "Direct Contract with client",
        "About The Role": "We're seeking a passionate and skilled Full Stack Developer with strong experience in Next.js, GraphQL, FastJS, and Dialogflow to join our growing team. In this role, you'll be building scalable web applications and intelligent conversational interfaces that deliver exceptional user experiences.",
        "Key Responsibilities": [
            "Design, develop, test, and maintain robust frontend and backend features using Next.js, GraphQL, and FastJS",
            "Integrate Dialogflow conversational flows with backend services and third-party APIs",
            "Collaborate closely with UI/UX designers and backend engineers to bring wireframes and APIs to life",
            "Optimize performance and ensure a seamless user experience across devices and browsers",
            "Write clean, maintainable, and scalable code following industry best practices",
            "Participate in code reviews, daily stand-ups, and agile ceremonies",
            "Implement and uphold application security and data protection standards"
        ],
        "Must-Have Skills": [
            "3+ years of hands-on experience in full stack web development",
            "Deep expertise in Next.js, including SSR, ISR, and API routes",
            "Strong working knowledge of GraphQL and FastJS",
            "Proven experience with Dialogflow (CX/ES) and backend service integrations",
            "Solid understanding of RESTful APIs, Webhooks, and asynchronous data flows",
            "Proficient with Git, Docker, and CI/CD pipelines",
            "Familiarity with modern authentication methods (OAuth, JWT, etc.)"
        ],
        "Nice-to-Have Skills": [
            "Experience with TypeScript",
            "Exposure to Cloud Functions, Google Cloud Platform (GCP), or Firebase",
            "Familiarity with chatbot analytics and NLP tuning",
            "Experience with headless CMS or modern content platforms"
        ],
        "Benefits": [
            "Competitive salary and benefits",
            "Flexible working hours and remote-friendly culture",
            "Opportunities to work with cutting-edge AI and web technologies",
            "A supportive, collaborative, and inclusive team environment",
            "Continuous learning and career growth opportunities"
        ],
        "How to apply for this opportunity?": [
            "Step 1: Click On Apply! And Register or Login on our portal.",
            "Step 2: Complete the Screening Form & Upload updated Resume",
            "Step 3: Increase your chances to get shortlisted & meet the client for the Interview!"
        ],
        "About Uplers": "Uplers is a hiring platform that helps connect tech talent with companies. This role is a direct contract opportunity with one of Uplers' clients, Steer Health. Uplers' role is to help talents find and apply for relevant opportunities and support during the engagement."
    },
    {
        "Job Title": "IT NINJA ( Full Stack Developer)",
        "Company": "VISSH MARINE",
        "Location": "Remote",
        "Type": "Full-time",
        "About the job": "Vissh Marine Technologies is looking for a battle-hardened full-stack developer to help us build the future of maritime tech. You'll be working across a wide suite of apps—from energy management to ship performance analytics. If you can handle front-end, back-end, infrastructure, and the occasional existential crisis, we want you.",
        "Responsibilities": [
            "Develop and maintain web/mobile apps (React, Node, Python, etc.)",
            "Own deployments, CI/CD pipelines, and cloud architecture (AWS, Azure)",
            "Build APIs and integrations with external services and legacy systems",
            "Collaborate with teams to ship scalable, user-friendly solutions",
            "Debug like a boss, write clean code, and not scream"
        ],
        "Requirements": [
            "3–5+ years of full-stack experience",
            "Hands-on with cloud infra, Git, Docker, and debugging nightmares",
            "Comfortable owning projects from concept to production",
            "Good communicator, independent thinker, team player-ish"
        ],
        "Bonus if you have": [
            "Experience in marine, energy, or logistics systems",
            "Dealt with real-time systems or IoT data"
        ],
        "Why You'll Survive Here": [
            "Minimal bureaucracy, max ownership",
            "Your code goes into real ships, not limbo",
            "Fast-paced, impact-driven, and weirdly fun"
        ],
        "About the company": "VISSH MARINE is your Partner in Safe, Efficient, and Sustainable Shipping Solutions.\n\nA newcomer with a bold mission—delivering innovative, data-driven technologies that help shipowners and managers enhance fleet performance, cut emissions, and achieve regulatory compliance.\n\nWe are here to revolutionize the maritime industry with our deep commitment to decarbonization and operational efficiency. At Vissh Marine, we believe the future of shipping lies in Sustainability and innovation. Our approach is built on leveraging data and cutting-edge technologies like intelligent Energy Management Systems to create tailored solutions for each vessel."
    },
    {
        "Job Title": "Senior Full Stack Developer",
        "Company Name": "Braintrust",
        "Location": "APJ (Remote)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "Job Description": "Senior Full Stack Flutter Developer",
        "What you'll be working on": [
            "Complete the remaining 20% of an existing mobile application",
            "Perform comprehensive bug fixes and performance optimization",
            "Prepare the application for App Store submission and deployment",
            "Refine and enhance the current application architecture",
            "Implement final user interface and user experience improvements"
        ],
        "Responsibilities": [
            "Conduct thorough code review and debugging of existing Flutter codebase",
            "Optimize application performance and reduce memory/processing overhead",
            "Ensure smooth cross-platform compatibility (iOS and Android)",
            "Prepare necessary documentation and release notes",
            "Manage App Store submission process and handle potential review requirements",
            "Collaborate with design and product teams to finalize application details",
            "Implement best practices for code quality and maintainability"
        ],
        "Requirements": [
            "Minimum 5 years of professional Flutter/Dart development experience",
            "Strong understanding of mobile app development lifecycle",
            "Proven experience with App Store submission and deployment processes",
            "Expert-level knowledge of Flutter framework and Dart programming",
            "Strong debugging and performance optimization skills",
            "Ability to work independently and provide technical guidance",
            "Portfolio demonstrating successful mobile application deployments"
        ],
        "About the company": "Braintrust is revolutionizing hiring with Braintrust AIR, the world's first and only end-to-end AI recruiting platform. Trained with human insights and proprietary data, Braintrust AIR reduces time to hire from months to days, instantly matching you with pre-vetted qualified candidates, and conducting the first round phone screen for you. Trusted by hundreds of Fortune 1000 enterprises including Nestlé, Porsche, Atlassian, Goldman Sachs, and Nike, Braintrust AIR is making talent acquisition professionals 100x more effective and saving companies hundreds of thousands of dollars in recruiting costs."
    },
    {
        "Job Title": "Senior Full Stack Developer - .Net Core/React.js",
        "Company": "Advantmed India LLP",
        "Location": "Remote",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level (6+ Years)",
        "Job Role Overview": "We are looking for a highly skilled Senior Software Developer with over 6 years of experience in software application programming and maintenance. The ideal candidate is responsible for developing, maintaining, and enhancing both new and existing applications and products. This role requires a proactive approach to learning and implementing new tools and technologies, as well as contributing to code reviews and optimization efforts.",
        "Key Responsibilities": [
            "Design, develop, and maintain scalable web applications using .NET Core, ASP.NET MVC, and C#.",
            "Build dynamic and responsive user interfaces using ReactJS, JavaScript, jQuery, AJAX, and CSS.",
            "Apply solid Object-Oriented Programming (OOP) principles to design clean and maintainable code.",
            "Collaborate with cross-functional teams to define, design, and deliver new features and enhancements.",
            "Perform version control and code collaboration using GIT and SVN.",
            "Write optimized database queries and procedures using MS SQL Server.",
            "Conduct thorough code reviews, identify areas for improvement, and implement performance optimizations.",
            "Troubleshoot, debug, and resolve technical issues across the full software development lifecycle.",
            "Stay up to date with emerging technologies and industry trends to continuously improve development practices."
        ],
        "Qualifications": [
            "Bachelor's degree in computer science, Information Technology, or related field.",
            "Minimum of 6+ Years of hands-on experience in .Net core, React.",
            "Experience with Cosmos/NoSQL, Node JS, Graph QL, azure, Function, Service Bus, Microservice Architecture (at least one of these) is added advantage."
        ],
        "What You'll Need": [
            "Strong commitment to delivering high-quality, error-free code with minimal supervision.",
            "A proactive, solution-oriented mindset with a collaborative attitude that adds value to the team.",
            "Ability to independently manage requirement analysis and provide accurate effort estimates.",
            "Flexibility and enthusiasm to learn and adapt to new technologies as needed.",
            "Solid understanding of industry trends, web application best practices, and accessibility standards.",
            "Excellent communication and interpersonal skills to work effectively with team members and stakeholders.",
            "Strong SQL Server programming skills with a focus on performance and optimization.",
            "Proven analytical and problem-solving abilities to troubleshoot complex technical issues.",
            "A self-motivated approach, with the ability to manage tasks independently and take ownership of deliverables"
        ],
        "About the company": "Advantmed's mission is to help health plans and providers thrive under value-based care. We accomplish this by providing a cost-effective suite of capabilities tailored to the unique needs of our clients, including risk adjustment analytics, medical record retrieval, medical record abstraction, risk adjustment coding, data validation, in-home health assessments, and provider education."
    },
    {
        "Job Title": "Specialist - DevOps Full Stack Developer",
        "Company": "Infineon Technologies",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Experience Level": "Entry level",
        "About the job": "We are looking for a highly motivated Junior IT Software Engineer with entry-level experience in developing, testing and releasing IT solutions. You will be involved in implementing and operating stable and performant IT Application Lifecycle Management solutions for our R&D community. Strong communication and collaboration skills are essential to grow in our cross-functional team environment.",
        "Job Description": [
            "Develop, configure and customize Application Lifecycle Management Solutions and their integrations mainly based on standard ALM applications.",
            "Develop high-quality software code that meets the requirements of the stakeholders.",
            "Manage the full lifecycle of changes from development to deployment.",
            "Maintain and operate these solutions having continuous improvement in mind.",
            "Work in cross-functional Scrum teams and follow DevOps practices & methods."
        ],
        "Your Profile": [
            "A degree in engineering, computer science or a related field (Bachelor/Master).",
            "0-2 years of hands-on experience in software development.",
            "Proficiency in one or more programming languages like Java, C#.",
            "Exposure to write clean code.",
            "Basic understanding of Client-Server architectures, microservices and test-driven development (TDD).",
            "Experience in agile methodologies, tools and DevOps practices.",
            "Strong problem-solving skills and attention to detail.",
            "Excellent communication and collaboration skills, with the ability to work effectively in a cross-functional team environment."
        ],
        "Contact": "Padmashali.external2@infineon.com",
        "Company Description": "As a global leader in semiconductor solutions in power systems and IoT, Infineon enables game-changing solutions for green and efficient energy, clean and safe mobility, as well as smart and secure IoT. Together, we drive innovation and customer success, while caring for our people and empowering them to reach ambitious goals. Be a part of making life easier, safer and greener.",
        "Diversity and Inclusion Statement": "We are on a journey to create the best Infineon for everyone. This means we embrace diversity and inclusion and welcome everyone for who they are. At Infineon, we offer a working environment characterized by trust, openness, respect and tolerance and are committed to give all applicants and employees equal opportunities. We base our recruiting decisions on the applicant´s experience and skills."
    },
    {
        "Job Title": "Financial Domain: Full Stack Developer with Data Engg. / Data Science experience",
        "Company": "Vertus Enterprises Inc. dba CMIT Solutions, JCMCH",
        "Location": "India (Remote)",
        "Job Type": "Full-time",
        "Company Description": "Vertus Solutions dba CMIT Solutions NYNJ offers proactive and dependable technology and data solutions to businesses with 24/7 mission critical operations. Its comprehensive technology and security solutions enable clients to grow their business and protect from security threats, accidental damages and errors.",
        "Role Description": [
            "Full stack developer with 5+ years of hands on experience in requirements analysis, technical design, full stack development of high performing financial applications using large scale data solutions using latest technology stacks.",
            "Work on challenging projects and interact with project and client team for a wide range of business applications and product/IP development.",
            "Deliver scalable solutions to complex financial problems.",
            "Taking ownership to meet deadlines with high quality deliverables.",
            "Develop solutions with the right architecture and technology.",
            "Build creative solutions that are economically feasible and operationally efficient.",
            "High volume transaction processing, front-end to application layer and back-end DB components development with performance optimization.",
            "Commitment to quality, timeliness, clean design and client satisfaction.",
            "Excellent communication skills are required for clients communication and demo/illustrations etc."
        ],
        "Qualifications": {
            "Experience": "5+ years of hands on experience",
            "Data Engineering/Science": [
                "Python",
                "SQL",
                "Scala",
                "Java",
                "Apache Spark",
                "Airflow",
                "Kafka",
                "Hadoop",
                "PostgreSQL",
                "MongoDB",
                "BigQuery"
            ],
            "Cloud": [
                "AWS (Glue, S3)",
                "Azure",
                "GCP",
                "ETL/ELT Pipelines"
            ],
            "Front end": [
                "C#",
                "ASP.NET",
                "MVC",
                "JavaScript/JQuery",
                "Bootstrap",
                "Angular",
                "React"
            ],
            "Middle tier": [
                "Java",
                "Spring boot",
                "WebApi Azure cloud/Graph APIs"
            ],
            "Back end": [
                "MS SQL Server",
                "Oracle",
                "PL/SQL",
                "NOSQL"
            ],
            "APIs & Messaging": [
                "RESTful API",
                "JSON",
                "XML",
                "Microservices",
                "Web API",
                "MQ/Topic",
                "Kafka"
            ],
            "Integration/Batch automation": [
                "API",
                "micro-services",
                "ETL (Pentaho, Informatica)",
                "batch automation (Tidal, Autosys)"
            ],
            "SDLC management": [
                "Azure",
                "Git",
                "Perforce",
                "Jira",
                "Confluence",
                "Bamboo"
            ],
            "Performance": [
                "scalability improvement",
                "performance optimization"
            ],
            "UI/UX design": [
                "Wireframing (Figma, Adobe etc.)"
            ],
            "DevOps": [
                "DevOps",
                "CI",
                "automated build",
                "Cloud native development and deployment"
            ],
            "Documentation & Communication": [
                "User documentation",
                "efficient communication"
            ],
            "Soft Skills": [
                "Strong problem-solving",
                "debugging",
                "communication",
                "teamwork abilities"
            ],
            "Education": "Bachelor's degree in Computer Science or related field"
        },
        "Benefits": [
            "Competitive package based on experience and productivity",
            "Flexible remote/ hybrid work",
            "New development opportunity (no legacy technology)",
            "Full SDLC experience from requirement to architecture, development and delivery",
            "Own and independently manage significant deliveries",
            "Leading technology, platforms and enterprise products to work with",
            "Constant learning and development of new technologies",
            "Ability to grow substantially and build a team",
            "Work culture where individual idea and creativity are encouraged",
            "Onsite opportunities when required by project"
        ]
    },
    {
        "Job Title": "Full Stack Developer, Software Engineering (C#, SQL Server, MVC, WEB API, JS frameworks (React.js))",
        "Company": "S&P Global",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Grade Level (for internal use)": "09",
        "About The Team": "You will work with a team of intelligent, ambitious, and hard-working software professionals. The team is responsible for the architecture, design, development, quality, and maintenance of the next-generation financial data web platform. Other responsibilities include transforming product requirements into technical design and implementation.",
        "What's In It For You (Role Specific)": [
            "Work with a skilled team while shaping the future of our products",
            "Build a next-generation UI financial product that consumers can rely on to make their financial decisions",
            "Work on next-generation products from a backend perspective",
            "Expand experience with modern cutting-edge technologies like front-end, DevOps, and cloud technologies",
            "Learn and master new technologies through cross-training, gaining versatile Full Stack experience"
        ],
        "The Impact": [
            "Developing innovative functionality in existing and new products",
            "Supporting and maintaining high-revenue productionized products",
            "Achieving the above intelligently and economically using best practices"
        ],
        "Responsibilities": [
            "Complete SDLC: architecture, design, development, and support of tech solutions",
            "Actively participate in all Scrum ceremonies and follow AGILE best practices effectively",
            "Play a key role in the development team to build high-quality, high-performance, scalable code",
            "Produce technical design documents and conduct technical walkthroughs",
            "Document and demonstrate solutions using technical design docs, diagrams, and stubbed code",
            "Work collaboratively with business partners to understand and clarify requirements",
            "Collaborate effectively with technical and non-technical stakeholders",
            "Design and develop industry-leading applications",
            "Respond to and resolve production issues"
        ],
        "What We're Looking For": {
            "Basic Required Qualifications": [
                "3-6 years of significant experience in full-stack application development",
                "Bachelor's or postgraduate degree in Computer Science, Information Systems, or equivalent (A bachelor's degree in Computer Science, Information Systems, or Engineering is required)",
                "Excellent analytical and communication skills, with strong verbal and writing proficiencies",
                "Expertise in C#, SQL Server, MVC, WEB API, and JavaScript frameworks (React.js)",
                "Proficient with software development lifecycle (SDLC) methodologies such as Agile and Test-driven development",
                "Familiarity with technologies like Docker, Kubernetes, AWS, and GraphQL",
                "Experience in developing solutions involving relational database technologies on the SQL Server platform, including stored procedure programming using Transact-SQL",
                "Superior knowledge of system architecture, object-oriented design, and design patterns",
                "Ability to train and mentor team members"
            ]
        },
        "About S&P Global Market Intelligence": "At S&P Global Market Intelligence, a division of S&P Global we understand the importance of accurate, deep and insightful information. Our team of experts delivers unrivaled insights and leading data and technology solutions, partnering with customers to expand their perspective, operate with confidence, and make decisions with conviction.\n\nFor more information, visit www.spglobal.com/marketintelligence.",
        "About S&P Global": "S&P Global provides governments, businesses, and individuals with market data, expertise, and technology solutions for confident decision-making. Our services span from global energy solutions to sustainable finance solutions. From helping our customers perform investment analysis to guiding them through sustainability and energy transition across supply chains, our solutions help unlock new opportunities and solve challenges.\n\nWe are widely sought after by many of the world's leading organizations to provide credit ratings, competitive benchmarking and data driven analytics in global capital markets, commodity, and automotive markets. Our divisions include S&P Global Market Intelligence, S&P Global Ratings, S&P Global Commodity Insights, S&P Global Mobility, S&P Dow Jones Indices, and the renowned S&P 500 index. Additionally, our S&P Global Sustainable1 brings sustainability benchmarking, analytics, and evaluations together, to help customers achieve their sustainability goals.",
        "Benefits": [
            "Health & Wellness: Health care coverage designed for the mind and body.",
            "Flexible Downtime: Generous time off helps keep you energized for your time on.",
            "Continuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.",
            "Invest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.",
            "Family Friendly Perks: It's not just about you. S&P Global has perks for your partners and little ones, too, with some best-in class benefits for families.",
            "Beyond the Basics: From retail discounts to referral incentive awards—small perks can make a big difference."
        ],
        "Equal Opportunity Employer": "S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person."
    },
    {
        "Job Title": "Sr. Full Stack .Net Developer (.Net+ Angular 5+ Years - Ahmedabad)",
        "Company": "Praeclarum Tech",
        "Location": "On-site (Ahmedabad, Gujarat, India)",
        "Job Type": "Full-time",
        "Experience": "5 to 10 Years",
        "About the job": "We are looking for an experienced and ambitious .NET Fullstack Developer to join our team. As a .NET FullStack Developer, you will be involved in design, development, coding, customization, configuration, testing, and deployment to support enterprise-packaged solutions.",
        "Role": "Sr. .NET FullStack Developer / Lead Developer",
        "Role & responsibilities": [
            "Develop, and maintain high-quality software applications using .NET Core, Angular, ASP.NET Core, Web API, C#, and SQL Server.",
            "Develop, and maintain responsive and user-friendly web applications using Angular (10+), TypeScript, HTML, and CSS.",
            "Collaborate with product managers, designers, and other team members to deliver high-quality software solution.",
            "Understand requirements, create and review designs, validate the architecture and ensure a high level of service offerings to clients in the technology domain.",
            "Participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, and perform code reviews and unit test plan reviews.",
            "Lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.",
            "Perform code optimization and troubleshooting to ensure optimal performance and reliability."
        ],
        "Qualifications": [
            "Bachelor's degree in Computer Science, Information Technology, or a related field.",
            "Minimum of 5 years of experience in full-stack development, with a focus on .NET technologies.",
            "Proficiency in .NET Core, C#, SQL, and Angular is essential.",
            "Strong understanding of web development principles and best practices.",
            "Experience with agile development methodologies and version control systems.",
            "Experience working with large-scale data sets and complex data transformations.",
            "Excellent problem-solving and analytical skills.",
            "Excellent communication and collaboration skills."
        ],
        "About the company": "We believe in the power of technology to transform businesses. At Praeclarum Tech, customer satisfaction is our top priority, and we are dedicated to delivering exceptional products. We specialize in transforming intricate business and enterprise software concepts into intuitive, user-friendly applications. With extensive experience in the medical, financial, and defense sectors, we create lightweight, sophisticated applications that are vital to our clients' success.",
        "Application Process": {
            "Instructions": "Interested candidates are invited to send their CVs",
            "Email": "career@praeclarumtech.com"
        }
    },
    {
        "job_title": "Full Stack Developer (PHP CodeIgniter)",
        "company": "Mayura Consultancy Services (MCS)",
        "location": "India",
        "work_type": "Full-time",
        "remote": true,
        "experience_level": "Associate",
        "experience_years": "3-5 years",
        "about_the_role": "MCS is seeking a talented and experienced Full Stack PHP Web Developer to join our dynamic team. As a Full Stack PHP Web Developer at MCS, you will be responsible for designing, developing, and maintaining scalable PHP-based web applications.",
        "responsibilities": [
            "Design, develop, and implement user interfaces and user experiences for web applications.",
            "Create and maintain well-structured, reusable, and efficient code for both front end and back end components.",
            "Develop interactive and responsive user interfaces using HTML, CSS, Bootstrap, Ajax, jQuery and JavaScript frameworks.",
            "Collaborate with designers to ensure seamless integration of design elements into the user interface.",
            "Build and maintain server-side applications using programming languages such as PHP, CodeIgniter, SQL and Laravel.",
            "Design and optimize databases, write efficient queries, and manage data storage and retrieval.",
            "Develop APIs (Application Programming Interfaces) for seamless communication between front end and back end systems.",
            "Ensure API security, performance, and adherence to industry standards.",
            "Use version control systems (e.g., Git) to manage code repositories and collaborate with team members.",
            "Deploy applications to production environments and manage continuous integration and continuous deployment (CI/CD) pipelines.",
            "Work closely with product managers, designers, and other developers to translate requirements into technical solutions.",
            "Participate in code reviews and provide constructive feedback to team members."
        ],
        "requirements": [
            "Position: Full Stack Developer ( PHP CodeIgniter)",
            "Company : Mayura Consultancy Services",
            "Experience: 3 yr To 5 yrs",
            "Location : India",
            "Skill: HTML, CSS, Bootstrap, JavaScript, Ajax, jQuery , PHP and CodeIgniter or CI",
            "Work Location: Work From Home (WFH)"
        ],
        "skills": [
            "HTML",
            "CSS",
            "Bootstrap",
            "JavaScript",
            "Ajax",
            "jQuery",
            "PHP",
            "CodeIgniter",
            "CI"
        ],
        "benefits": [
            "Complete Work From Home Opportunity: Enjoy the flexibility of working entirely from the comfort of your home, empowering you to manage your schedule and achieve a better work-life balance while coding innovative solutions for MCS.",
            "Opportunity to Work on Projects Developing from Scratch: Engage in projects from inception to completion, working on solutions developed from scratch and having the opportunity to make a significant impact on the design, architecture, and functionality of the final product.",
            "Diverse Projects: Be involved in a variety of development projects, including web applications, mobile apps, e-commerce platforms, and more, allowing you to showcase your versatility as a Full Stack Developer and expand your portfolio."
        ]
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": [
            "Full-time",
            "Entry level (Open to all levels)",
            "Contractual remote work opportunity"
        ],
        "About the job": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes)."
        ],
        "Note": "Shortlisted candidates may be required to complete a coding assessment as part of the selection process.",
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities... and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts..."
    },
    {
        "Job Title": "Junior Full Stack Developer (Remote)",
        "Company": "Braintrust",
        "Location": "Remote (APJ)",
        "Employment Type": "Full-time",
        "Experience Level": "Entry level",
        "What you'll be working on": [
            "Developing front-end web applications using React, Next.js, or similar frameworks",
            "Building back-end APIs and services using Node.js, Express, or Python/Flask",
            "Integrating cloud services like AWS, GCP, or Azure for hosting, databases, analytics etc.",
            "Implementing and optimizing databases like MongoDB, MySQL, PostgreSQL"
        ],
        "Responsibilities": [
            "Design and build features for internal and customer-facing web applications",
            "Develop RESTful APIs to support front-end applications",
            "Integrate third party APIs and services",
            "Perform debugging, testing and maintenance of applications",
            "Collaborate with other teams on application architecture and designs"
        ],
        "Requirements": [
            "1+ years of experience building web applications with JavaScript or Python",
            "Experience with or strong knowledge of front-end frameworks like React/Next.js and back-end frameworks like Node.js/Express or Python/Flask",
            "Hands-on experience with at least one major cloud provider (like AWS, GCP, Azure)",
            "Experience with relational and non-relational databases, with an understanding of database operations",
            "Proven track record of designing and implementing REST APIs",
            "Understanding of software design principles and development best practices",
            "US work hours required"
        ],
        "About the company": "Braintrust is revolutionizing hiring with Braintrust AIR, the world's first and only end-to-end AI recruiting platform. Trained with human insights and proprietary data, Braintrust AIR reduces time to hire from months to days, instantly matching you with pre-vetted qualified candidates, and conducting the first round phone screen for you. Trusted by hundreds of Fortune 1000 enterprises including Nestlé, Porsche, Atlassian, Goldman Sachs, and Nike, Braintrust AIR is making talent acquisition professionals 100x more effective and saving companies hundreds of thousands of dollars in recruiting costs."
    },
    {
        "Job Title": "Full Stack Developer (NextJS/Fastjs)",
        "Company": "Uplers",
        "Location": "Remote (Ahmedabad, Gujarat, India)",
        "Opportunity Type": [
            "Remote",
            "Full-time",
            "Indefinite Contract (40 hrs a week/160 hrs a month)"
        ],
        "Level": "Mid-Senior level",
        "Experience": "3+ years",
        "Salary": "USD 18,000 - 30,000 / year (based on experience)",
        "Expected Notice Period": "15 Days",
        "Shift": "(GMT+05:30) Asia/Kolkata (IST) - 10 AM - 7 PM IST",
        "Client": "Steer Health",
        "About The Role": "We're seeking a passionate and skilled Full Stack Developer with strong experience in Next.js, GraphQL, FastJS, and Dialogflow to join our growing team. In this role, you'll be building scalable web applications and intelligent conversational interfaces that deliver exceptional user experiences.",
        "Key Responsibilities": [
            "Design, develop, test, and maintain robust frontend and backend features using Next.js, GraphQL, and FastJS",
            "Integrate Dialogflow conversational flows with backend services and third-party APIs",
            "Collaborate closely with UI/UX designers and backend engineers to bring wireframes and APIs to life",
            "Optimize performance and ensure a seamless user experience across devices and browsers",
            "Write clean, maintainable, and scalable code following industry best practices",
            "Participate in code reviews, daily stand-ups, and agile ceremonies",
            "Implement and uphold application security and data protection standards"
        ],
        "Must-Have Skills": [
            "3+ years of hands-on experience in full stack web development",
            "Deep expertise in Next.js, including SSR, ISR, and API routes",
            "Strong working knowledge of GraphQL and FastJS",
            "Proven experience with Dialogflow (CX/ES) and backend service integrations",
            "Solid understanding of RESTful APIs, Webhooks, and asynchronous data flows",
            "Proficient with Git, Docker, and CI/CD pipelines",
            "Familiarity with modern authentication methods (OAuth, JWT, etc.)"
        ],
        "Nice-to-Have Skills": [
            "Experience with TypeScript",
            "Exposure to Cloud Functions, Google Cloud Platform (GCP), or Firebase",
            "Familiarity with chatbot analytics and NLP tuning",
            "Experience with headless CMS or modern content platforms"
        ],
        "Benefits": [
            "Competitive salary and benefits",
            "Flexible working hours and remote-friendly culture",
            "Opportunities to work with cutting-edge AI and web technologies",
            "A supportive, collaborative, and inclusive team environment",
            "Continuous learning and career growth opportunities"
        ],
        "Engagement Model": [
            "Direct Contract with client",
            "This is a remote Role"
        ],
        "Interview Rounds": "3 rounds",
        "How to apply for this opportunity?": [
            "Step 1: Click On Apply! And Register or Login on our portal.",
            "Step 2: Complete the Screening Form & Upload updated Resume",
            "Step 3: Increase your chances to get shortlisted & meet the client for the Interview!"
        ],
        "About Uplers": "Our goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement. (Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well). So, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!"
    },
    {
        "Job Title": "Staff Specialist - DevOps Full Stack Developer",
        "Company": "Infineon Technologies",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Level": "Mid-Senior level",
        "About the job": "We are looking for an accomplished and experienced full-stack developer to join our team to support the IT Application Lifecycle Management solutions to design and develop solutions for Infineon's R&D community.",
        "Job Description": {
            "Delivery": [
                "Configure and Customize Application Lifecycle Solutions (ALM) like Siemens Polarion.",
                "Ensure high quality deliverables within a stable and automated CI/CD process.",
                "Act with the delivery mindset and culture within the agile teams.",
                "Take the responsibility for all DevOps activities."
            ],
            "Infrastructure": "Manage ALM infrastructure activities including cluster configuration, LDAP integration and compliant to Infineon infrastructure.",
            "Integration": "Collaborate with cross-functional teams and contribute to the integration efforts with other applications in the Infineon IT landscape like Enterprise Architect, Jama, Jira, Tessy, Jenkins, Bitbucket, Gitlab.",
            "Operations": "Minimise defects in production. Learn from defects and institutionalise the learnings.",
            "Compliance": "Ensure all topics of Information Security, Data Confidentiality and Compliance are considered.",
            "Documentation": "Ensure suitable application and system documentation, user manuals and user trainings are available."
        },
        "Your Profile": [
            "A degree in engineering, computer science or a related field (Bachelor/Master).",
            "5+ years of hands-on experience in software development and knowledge in architectural design and system integration.",
            "Hands-on experience in configuring and customizing ALM solutions like Siemens Polarion would be an advantage.",
            "Expertise in modern web development frameworks (e.g. Angular, React, Node.js, ASP.NET Core), and proficiencies in programming languages like Java, C++, C#, JavaScript.",
            "Strong background in working with relational databases like MSSQL.",
            "Experience with building integrations based on an event driven approach, e.g. Siemens Polarion integration with other tools (e.g., Jama, JIRA, Enterprise Architect) and version control systems (e.g., Bitbucket, Gitlab).",
            "Experience with software configuration management tools such as Git, SVN.",
            "Proficiency in Agile methodologies, tools, and DevOps practices, and experience in technical and systems architecting, including cloud deployment of Polarion-based solutions.",
            "Excellent logical thinking and problem-solving skills, with a track record of successfully addressing complex technical challenges."
        ],
        "Contact": "Padmashali.external2@infineon.com",
        "About Infineon Technologies": "As a global leader in semiconductor solutions in power systems and IoT, Infineon enables game-changing solutions for green and efficient energy, clean and safe mobility, as well as smart and secure IoT. Together, we drive innovation and customer success, while caring for our people and empowering them to reach ambitious goals. Be a part of making life easier, safer and greener.\nWe are on a journey to create the best Infineon for everyone. This means we embrace diversity and inclusion and welcome everyone for who they are. At Infineon, we offer a working environment characterized by trust, openness, respect and tolerance and are committed to give all applicants and employees equal opportunities. We base our recruiting decisions on the applicant´s experience and skills."
    },
    {
        "Job Title": "Full Stack Developer, Software Engineering (C#, SQL Server, MVC, WEB API, JS frameworks (React.js))",
        "Company": "S&P Global",
        "Location": "On-site (Ahmedabad, Gujarat, India)",
        "Job Type": "Full-time",
        "About The Team": "You will work with a team of intelligent, ambitious, and hard-working software professionals. The team is responsible for the architecture, design, development, quality, and maintenance of the next-generation financial data web platform. Other responsibilities include transforming product requirements into technical design and implementation.",
        "What's In It For You (Role)": [
            "Hone your existing software development skills while having the chance to become exposed to the latest cutting-edge technologies available in the market.",
            "Work with a skilled team while shaping the future of our products",
            "Build a next-generation UI financial product that consumers can rely on to make their financial decisions",
            "Work on next-generation products from a backend perspective",
            "Expand experience with modern cutting-edge technologies like front-end, DevOps, and cloud technologies",
            "Learn and master new technologies through cross-training, gaining versatile Full Stack experience"
        ],
        "The Impact": [
            "Be part of the team that builds next-generation financial data products and platforms.",
            "Contribute significantly to the growth of the firm by:",
            "Developing innovative functionality in existing and new products",
            "Supporting and maintaining high-revenue productionized products",
            "Achieving the above intelligently and economically using best practices"
        ],
        "Responsibilities": [
            "Complete SDLC: architecture, design, development, and support of tech solutions",
            "Actively participate in all Scrum ceremonies and follow AGILE best practices effectively",
            "Play a key role in the development team to build high-quality, high-performance, scalable code",
            "Produce technical design documents and conduct technical walkthroughs",
            "Document and demonstrate solutions using technical design docs, diagrams, and stubbed code",
            "Work collaboratively with business partners to understand and clarify requirements",
            "Collaborate effectively with technical and non-technical stakeholders",
            "Design and develop industry-leading applications",
            "Respond to and resolve production issues"
        ],
        "Basic Required Qualifications": [
            "3-6 years of significant experience in full-stack application development",
            "Bachelor's or postgraduate degree in Computer Science, Information Systems, or equivalent",
            "Excellent analytical and communication skills, with strong verbal and writing proficiencies",
            "Expertise in C#, SQL Server, MVC, WEB API, and JavaScript frameworks (React.js)",
            "Proficient with software development lifecycle (SDLC) methodologies such as Agile and Test-driven development",
            "Familiarity with technologies like Docker, Kubernetes, AWS, and GraphQL",
            "Experience in developing solutions involving relational database technologies on the SQL Server platform, including stored procedure programming using Transact-SQL",
            "Superior knowledge of system architecture, object-oriented design, and design patterns",
            "Ability to train and mentor team members"
        ],
        "About S&P Global Market Intelligence": "At S&P Global Market Intelligence, a division of S&P Global we understand the importance of accurate, deep and insightful information. Our team of experts delivers unrivaled insights and leading data and technology solutions, partnering with customers to expand their perspective, operate with confidence, and make decisions with conviction.",
        "About S&P Global": "S&P Global provides governments, businesses, and individuals with market data, expertise, and technology solutions for confident decision-making. Our services span from global energy solutions to sustainable finance solutions. From helping our customers perform investment analysis to guiding them through sustainability and energy transition across supply chains, our solutions help unlock new opportunities and solve challenges. We are widely sought after by many of the world's leading organizations to provide credit ratings, competitive benchmarking and data driven analytics in global capital markets, commodity, and automotive markets.",
        "What's In It For You (Benefits)": "We take care of you, so you can take care of business. We care about our people. That's why we provide everything you—and your career—need to thrive at S&P Global.",
        "Our Benefits Include": [
            "Health & Wellness: Health care coverage designed for the mind and body.",
            "Flexible Downtime: Generous time off helps keep you energized for your time on.",
            "Continuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.",
            "Invest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.",
            "Family Friendly Perks: It's not just about you. S&P Global has perks for your partners and little ones, too, with some best-in class benefits for families.",
            "Beyond the Basics: From retail discounts to referral incentive awards—small perks can make a big difference."
        ]
    },
    {
        "Job Title": "Full Stack Developer (Front End Specialization)",
        "Company": "InRisk Labs",
        "Location": "On-site (Ahmedabad, Gujarat, India)",
        "Job Type": "Full-time",
        "About the Company": "InRisk Labs is redefining the way risk is actively managed through Smart Index Insurance solutions. By leveraging cutting-edge tech, we are committed to providing a proactive, data-driven methodology for assessing and mitigating the adverse impacts of climate, market volatility, calamities, and other extreme events.",
        "Position Overview": "We are seeking a Full Stack Developer with a strong specialization in front-end technologies, particularly React and Tailwind CSS. In this role, you will build, optimize, and maintain cloud-based platforms and applications that support climate risk solutions. While you will work across both front-end and back-end development, the emphasis will be on crafting intuitive, responsive, and high-performance user interfaces. You'll collaborate closely with data scientists, researchers, and product teams to deliver innovative, data-driven insurance solutions.",
        "Key Responsibilities": [
            "Design and implement high-quality, responsive user interfaces using React and Tailwind CSS.",
            "Develop and maintain scalable web applications, including back-end integration and data handling.",
            "Implement and maintain RESTful APIs to integrate data from multiple sources, including climate data and real-time analytics.",
            "Work with relational and NoSQL databases to ensure efficient data storage and retrieval for large-scale datasets.",
            "Develop secure, scalable server-side logic, working with cloud-based infrastructure (AWS, Azure, or GCP).",
            "Collaborate with product managers, researchers, and data scientists to deliver seamless solutions.",
            "Ensure code quality through automated tests and code reviews.",
            "Stay updated with the latest technologies and best practices in full stack development."
        ],
        "Qualifications": {
            "Education": "Bachelor's or Master's degree in Computer Science, Software Engineering, or related field, preferably from top-tier engineering institutions like IITs and NITs.",
            "Experience": "2+ years in full stack development with a focus on front-end frameworks.",
            "Technical Skills": [
                "React",
                "Tailwind CSS",
                "Redux",
                "Next.js",
                "Node.js",
                "Python",
                "MySQL/PostgreSQL",
                "AWS/Azure/GCP",
                "RESTful APIs",
                "Docker",
                "Kubernetes"
            ]
        }
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "Prepleaf by Masai",
        "Location": "Remote (India)",
        "Type": "Full-time",
        "Level": "Associate",
        "About Prepleaf": "Prepleaf builds educational experiences that are both deeply technical and human-focused. We value team members who are curious, adaptable, and excited to build impactful products.",
        "Role Overview": "We are looking for a Full Stack Developer who can build high-quality web applications end-to-end. You'll be expected to take ownership of features, from UI components to backend logic and deployment.",
        "What You'll Do": [
            "Design and develop scalable web apps using modern full-stack technologies",
            "Build responsive and intuitive front-end interfaces (React, Vue, etc.)",
            "Architect robust backend systems using Node.js, Express, or Python-based frameworks",
            "Work with databases like PostgreSQL, MongoDB, and cloud platforms like AWS/GCP",
            "Optimize performance, handle edge cases, and write unit/integration tests"
        ],
        "What You'll Need": [
            "1-2 years of experience in full stack development (or strong internship/projects portfolio)",
            "Proficiency in HTML/CSS, JavaScript, and React/Next.js",
            "Backend experience with Express, Flask, or similar",
            "Understanding of REST APIs, MVC, Git, and deployment workflows"
        ],
        "Educational Background": [
            "Bachelor's in Computer Science or related field",
            "Candidates from our CSE/AI/ML credit-linked programs or with portfolio projects preferred"
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "PartnerOne",
        "Location": "India (Remote)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "About the job": "We are looking for someone to join our existing team of developers to help us take our efficiency to the next level!",
        "Responsibilities": [
            "Design, develop, and maintain robust, scalable, and secure full-stack web applications",
            "Build intuitive and responsive user interfaces using Vue.js and React",
            "Develop server-side logic, APIs, and database interactions using Java and Spring Boot",
            "Ensure code quality through proper testing, debugging, and adherence to coding standards",
            "Integrate third-party libraries, APIs, and systems (e.g., ViewIS) into the application",
            "Maintain and enhance existing applications, ensuring compatibility with evolving technologies",
            "Monitor application performance and troubleshoot any issues to ensure optimal functionality",
            "Collaborate with product managers, designers, and stakeholders to translate business requirements into technical specifications",
            "Work closely with cross-functional teams, including UI/UX designers, QA engineers, and DevOps teams"
        ],
        "Requirements": {
            "General Experience": "5+ years of experience as a Full Stack Developer or in a similar role",
            "Hands-on Experience": "Hands-on experience in building and deploying web applications",
            "Front-End Development": [
                "Proficiency in Vue.js and React, with a strong understanding of component-based architecture",
                "Experience with modern front-end build tools (e.g., Webpack, Vite, or similar)",
                "Familiarity with state management libraries (e.g., Vuex, Redux)",
                "Knowledge of responsive design and CSS frameworks (e.g., Tailwind, Bootstrap)"
            ],
            "Back-End Development": [
                "Strong proficiency in Java and frameworks like Spring Boot",
                "Experience building RESTful APIs and microservices",
                "Experience with database systems (e.g., MySQL, PostgreSQL, MongoDB)",
                "Knowledge of authentication and authorization mechanisms (e.g., OAuth, JWT)"
            ],
            "Additional Skills": [
                "Experience with tools like Docker and Kubernetes are a plus",
                "Proficiency in version control systems (e.g., Git) and CI/CD pipelines",
                "Strong problem-solving and debugging skills"
            ]
        },
        "About the company": "PartnerOne acquires and grows enterprise software companies for the long term. We have very strong financial resources, combined with an agile and entrepreneurial mindset.\nWe move quickly and decisively, free from bureaucracy or red tape, ensuring a smooth and fair acquisition process. Whether it's a divestiture, restructuring or carve out, we provide a fast and seamless transition.\nOnce acquired, we invest in sustainable growth—leveraging our deep industry expertise, shared resources, and global network to strengthen each business. We build our companies for the future, ensuring stability for customers, partners and employees."
    },
    {
        "Job Title": "Full stack Developer (Freelancer)",
        "Company": "Soul AI",
        "Location": "Remote",
        "Type": "Part-time, Freelance",
        "About Us": "Soul AI is a pioneering company founded by IIT Bombay and IIM Ahmedabad alumni, with a strong founding team from IITs, NITs, and BITS. We specialize in delivering high-quality human-curated data, AI-first scaled operations services, and more. Based in SF and Hyderabad, we are a young, fast-moving team on a mission to build AI for Good, driving innovation and positive societal impact.",
        "Job Summary": "We are seeking a talented Full Stack Developer to work on both the front-end and back-end of our web applications. You will build scalable and efficient web solutions while collaborating with cross-functional teams.",
        "Key Responsibilities": [
            "Develop both front-end and back-end systems.",
            "Design user-friendly web applications that are scalable and secure.",
            "Work closely with design, product, and backend teams to ensure cohesive development."
        ],
        "Required Qualifications": [
            "3+ years of experience in full-stack development.",
            "Proficiency with front-end technologies like HTML, CSS, JavaScript, and back-end technologies like Node.js, Django, or Ruby on Rails.",
            "Experience with relational and NoSQL databases (e.g., MySQL, MongoDB)."
        ],
        "Benefits": [
            "Flexible hours.",
            "Remote opportunity."
        ],
        "Pay/Salary": "Competitive pay (₹1200/hour). Pay will vary by project and typically is up to Rs. 1200 per hour (if you work an average of 3 hours every day - that could be as high as Rs. 108K per month) once you clear our screening process."
    },
    {
        "Job Title": "Full-Stack Web Developer – Cybersecurity Lab Interface Platform",
        "Company": "Security Impossible",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "About the Product": "We're building a cloud-based web application designed to manage and orchestrate virtual environments through an intuitive admin interface. The system enables users to create, configure, and schedule compute resources, manage access, and monitor sessions — all from a single, secure control panel. This is not just another admin dashboard — it's a mission-critical orchestration tool, built with a focus on scalability, security, and workflow automation. The platform must support high-volume provisioning, secure user-resource mapping, and real-time management, all while maintaining a clean and reliable user experience.",
        "What You'll Be Working On": [
            "Working directly with the Product Leads",
            "Expected to take full ownership of implementation",
            "Dynamic form-driven lab creation and configuration flows",
            "Backend workflows for secure student-to-VM assignment",
            "A scheduler engine to auto-launch and shut down labs",
            "Admin panels for managing VMs, monitoring activity, and enforcing quotas",
            "Backend queues to process high-volume VM requests securely",
            "API integrations with cloud services using best practices for authentication and rate-limiting"
        ],
        "Who We're Looking For": [
            "Thinks clearly, communicates well, and asks smart questions when needed",
            "Has the common sense to solve problems independently without getting stuck",
            "Understands the big picture, but also sweats the details",
            "Can read a brief, ask clarifying questions, and deliver reliable, tested results",
            "Writes code that's clean, modular, and maintainable"
        ],
        "Tech Stack": {
            "Frontend": [
                "JavaScript (92.6%)",
                "HTML",
                "CSS"
            ],
            "Backend": [
                "Node.js",
                "React.js"
            ],
            "Database": [
                "MongoDB"
            ],
            "Cloud Platform": [
                "Azure (used for provisioning, access, and resource control)"
            ]
        },
        "Tech Stack Notes": "You don't need to be an Azure expert — but you must understand web architecture, security-first development, and how to design systems that scale.",
        "Must-Have Skills": [
            "3+ years of full-stack web development experience",
            "Strong knowledge of JavaScript/Node.js",
            "Solid understanding of secure web development, especially in multi-user systems",
            "Experience working with queues, scheduling, and async backend processes",
            "Knows how to handle RBAC, tokens, API communication, and form validation"
        ],
        "Bonus Skills": [
            "Familiarity with education platforms or cloud-based lab delivery"
        ],
        "Why This Role Matters": "You'll be building the engine behind a product that powers cybersecurity education across universities — enabling instructors to deliver cloud labs that feel real, safe, and seamless.",
        "What you'll get": [
            "Direct collaboration with the product lead",
            "A fast-moving, supportive startup environment",
            "The chance to do meaningful work in the cybersecurity training space"
        ],
        "How to Apply": [
            "Send us: A link to your GitHub, portfolio, or a project you're proud of",
            "Send us: A short note about why this kind of product interests you"
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "Cojective Labs",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Seniority Level": "Mid-Senior level",
        "About the Job": "You will have the unique opportunity to design, develop, and deploy new applications and features that will directly impact the bottom line, to ultimately provide better and more affordable health care for our customers. Our team uses a variety of technologies, from big data to the latest web frameworks. You will get to build state-of-the-art technology that is scalable and robust, utilizing cloud infrastructure, and full automation.\n\n*   You need to have the capability to lead and contribute to engineering efforts from design to implementation, solving sophisticated technical challenges around developer and engineering efficiency and velocity.\n*   Ability to rapidly prototype and storyboard/wireframe development as part of application design.\n*   Make use of existing frameworks and tools, customizing and building from scratch where vital, identifying gaps or inefficiencies and suggesting improvements.\n*   Demonstrate knowledge of software development, life cycle, modeling of business processes, application design patterns, business/functional documents. Estimates to high level business requirements and provide options analysis.\n*   You'll need to work in an Agile development environment as a hands-on developer designing, supporting, and delivering technology solutions to transform healthcare into a safer and more cost-effective industry.\n*   Ability to always innovate and learn, ability to design and architect alternative solutions independently, take ownership and accountability of your work.\n*   A desire to collaborate in a high-performing team environment, and an ability to influence and be influenced by others.\n*   A deep understanding of environmental constraints to implementing and deploying differing application solutions.",
        "Requirements": [
            "Strong understanding of JavaScript and Node.js concepts such as event-driven programming, asynchronous programming, and modules.",
            "Experience with Node.js frameworks like Express.js for building RESTful APIs and web applications.",
            "Knowledge of npm (Node Package Manager) for managing dependencies and packages.",
            "Understanding of Node.js performance optimization techniques and best practices.",
            "Proficiency in React.js fundamentals including components, state management, props, and lifecycle methods.",
            "Experience with React Router for client-side routing in single-page applications.",
            "Knowledge of state management libraries like Redux or Context API for managing application-level state.",
            "Familiarity with modern React features such as hooks, context, and suspense.",
            "Strong SQL skills including database design, schema creation, and writing complex queries.",
            "Experience with PostgreSQL-specific features such as JSONB data type, full-text search, and transactions.",
            "Knowledge of database indexing, query optimization, and performance tuning.",
            "Understanding of database security practices including role-based access control and data encryption.",
            "Proficiency in Azure services relevant to application deployment and management such as EC2, S3, RDS (for PostgreSQL), IAM, and CloudFormation.",
            "Experience with Azure Lambda for serverless computing and API Gateway for building RESTful APIs.",
            "Knowledge of Azure deployment strategies, scalability, monitoring, and cost optimization.",
            "Understanding of Azure security practices including VPC, security groups, and encryption at rest and in transit.",
            "Understanding of FHIR profiles and resource extensions for customizing and extending FHIR data models to meet specific healthcare requirements.",
            "Experience with FHIR terminology services and value sets for standardized code systems and clinical terminologies.",
            "Having expertise in related technologies and tools like Git for version control, CI/CD pipelines, unit testing frameworks (e.g., Jest, Mocha), and knowledge of design patterns and software architecture principles."
        ],
        "About the company": "Cojective Labs provides back-office support services for tech companies and startups around the world."
    },
    {
        "Job Title": "Java Full Stack Developer",
        "Company Name": "Programmers.io",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Experience Level": "Mid-Senior level",
        "Experience Range": "7+ Years",
        "About the company": "Programmers.io is an ISO9001 & 27001-certified IT company with 1000+ experts supporting legacy and modern platforms for Fortune 500 and NYSE clients since 2012. Based in Texas, we offer advanced products, services, and solutions that deliver value and customer satisfaction. With a reputed Center of Excellences comprising Amazon, Google, IBM, Microsoft, and Oracle-certified technology professionals, we specialize in: 1.  AI Enablement and Data Platforms: AI/ML enablement, data engineering, data estate management, and integrations. 2.  Application Modernization: Application development, AI/ML/LLM integration, cloud migration, intelligent automation, and low-code/no-code development. 3.  Cloud Engineering and Platform Readiness: Agile cloud deployments, APM implementation, migration to Azure, AWS, GCP, and other cloud servers, and security and compliance monitoring. 4.  Integration: Architecture integration, IBM i (formerly AS/400) modernization assessment, EDI incorporation, and Kafka and MuleSoft implementation. 5.  Legacy Platform Support: AI enablement, COBOL/RPG/Synon-based application upgradation, DB2 modernization, DevOps implementation, and IBM i platform support. Our commitment to excellence is reflected in a 96.8% client satisfaction score, 4.9 ratings on Clutch, and 4+ stars ratings for code quality and turnaround time. Beyond our services, we also provide innovative products designed to accelerate development, modernization, and integration projects. With flexible business models, you can experience a risk-free digital transformation that exceeds expectations.",
        "Key Responsibilities": [
            "Collaborate with cross-functional teams to design and develop high-performance applications using Java, Angular (12+), and related technologies.",
            "Develop and maintain RESTful APIs and microservices to support application functionality.",
            "Ensure seamless integration between front-end (Angular) and back-end (Java, Spring Boot) components.",
            "Architect scalable applications that support large user bases (1000+ users at a time).",
            "Contribute to the design and maintenance of application architecture, ensuring efficient performance and scalability.",
            "Participate in Agile development processes, including sprint planning, standups, and retrospectives.",
            "Develop and implement unit test cases, ensuring comprehensive test coverage for all features.",
            "Manage deployments and build frameworks for software solutions, incorporating DevOps best practices.",
            "Maintain high code quality by following best practices for design patterns, testing, and documentation.",
            "Work with cloud platforms (AWS/Azure) to deploy and scale applications.",
            "Ensure the development and maintenance of responsive, visually appealing UI using HTML5, CSS3, and Angular.",
            "Utilize state management libraries (e.g., NgRx, Akita) for efficient handling of application state.",
            "Manage asynchronous data flow using RxJS and other reactive programming techniques.",
            "Contribute to the development of SaaS solutions, ensuring high availability and scalability."
        ],
        "Required Qualifications": [
            "8+ years of experience in software development, with a strong focus on Java and Angular (12+).",
            "Expertise in Java (Java 8/Java 11), Spring Boot, and microservices.",
            "Solid experience with RESTful API development and microservices architecture.",
            "Proficient in HTTP/HTTPS protocol and TCP/IP networking.",
            "Hands-on experience with Java Backend API technologies: JEE, Spring Core, Spring Boot, JPA, and cloud platforms (AWS/Azure).",
            "Experience with full lifecycle software development and Agile methodologies.",
            "Proficient in unit testing and Test-Driven Development (TDD).",
            "Strong knowledge of Object-Oriented Design (OOD), design patterns, and application integration.",
            "Experience in architecting scalable applications capable of supporting 1000+ users.",
            "Expertise in modern development tools such as Git, CI/CD, Docker, and Agile practices.",
            "Hands-on experience with automated test frameworks such as Cypress, Jasmine, and Karma.",
            "Proficient in STS (Spring Tool Suite) as an IDE for Java development."
        ],
        "Preferred Skills": [
            "Proficient in TypeScript for building dynamic web applications.",
            "Experience in scaling SaaS software solutions.",
            "Expertise in building and managing distributed tech stacks.",
            "Knowledge of reactive programming, particularly RxJS for Angular applications.",
            "Familiarity with state management libraries like NgRx and Akita.",
            "Proficiency in HTML5, CSS3, and responsive web design techniques.",
            "Experience with cloud environments (Azure or AWS).",
            "Familiarity with DevOps tooling and practices at a platform level.",
            "Strong experience with the Visual Studio Code IDE.",
            "3+ years of work experience with C#",
            "3+ years of work experience with .NET Framework",
            "3+ years of work experience with .NET Core"
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "Jupiter AI Labs",
        "Location": "Remote (India)",
        "Job Type": "Full-time, Executive",
        "About the Company": "Jupiter AI Labs Inc. is Product and service development Generative AI company for SMBs and startup to help build systems that learn how to solve challenges.",
        "Description": "As a passionate and talented Full Stack Developer, you will be responsible for designing, developing, and maintaining scalable web applications using Python and modern front-end technologies. You will work closely with product managers, designers, and other engineers to deliver high-quality software solutions.",
        "Responsibilities": [
            "Design, develop, test, and deploy robust web applications using Python (Django, Flask, or FastAPI)",
            "Collaborate with cross-functional teams to define, design, and ship new features.",
            "Build and maintain RESTful APIs and integrate with third-party services.",
            "Write clean, maintainable, and efficient code following best practices.",
            "Participate in code reviews, troubleshooting, and performance tuning.",
            "Ensure the security and scalability of applications.",
            "Contribute to all phases of the software development lifecycle.",
            "Stay up to date with emerging technologies and propose improvements to existing systems."
        ],
        "Requirements": [
            "Overall experience of 3-6 years.",
            "3+ years of Industry experience in Full Stack Development",
            "2+ years of hands-on experience in Python and at least one Python web framework (Django, Flask, or FastAPI).",
            "Experience with containerization (Docker) and cloud platforms (AWS, Azure, or GCP) is a plus.",
            "Excellent problem-solving skills and attention to detail.",
            "Experience with CI/CD pipelines and automated testing.",
            "Knowledge of microservices architecture.",
            "Familiarity with Agile/Scrum development methodologies.",
            "Contribution to open-source projects or a strong GitHub portfolio."
        ]
    },
    {
        "Job Title": "Full Stack Developer",
        "Company Name": "Techify Solutions Pvt Ltd",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Experience Level": "Entry level (1-4 Years, excluding internships & Freelancing)",
        "Salary": "3 LPA to 7 LPA",
        "Summary": "We are looking for a skilled Full Stack (MERN) Developer with 2-4 years of experience to join our team. The ideal candidate will have a strong foundation in Full stack development, with a focus on building scalable and efficient web applications. In this role, you will collaborate with cross-functional teams to design, develop, and implement innovative solutions that meet our business objectives.",
        "Key Responsibilities": [
            "Design and develop user interfaces using React.js, Next.js, HTML, and CSS",
            "Build and maintain server-side logic using Node.js and Express.js or Nest.js",
            "Develop and integrate APIs for seamless communication between front-end and back-end systems.",
            "Work with PostgreSQL / MySQL to store, retrieve, and manipulate data.",
            "Collaborate with designers, product managers, and other stakeholders to translate requirements into technical specifications.",
            "Write clean, efficient, and maintainable code following best practices and coding standards.",
            "Conduct code reviews and provide constructive feedback to other team members.",
            "Troubleshoot and debug issues across the stack.",
            "Stay updated on emerging technologies and industry trends.",
            "Contribute to the continuous improvement of development processes and tools."
        ],
        "Requirements": [
            "Experience with NodeJS, GraphQL (Must)",
            "Advanced proficiency in NodeJS & ReactJS",
            "Strong command on JavaScript",
            "Experience with Microservice Architecture",
            "Problem-solving: Demonstrated ability to effectively analyze and solve technical challenges.",
            "Must have experience with Git",
            "Strong troubleshooting skills",
            "Good communication skills.",
            "Automotive domain knowledge."
        ],
        "About the company": "Techify Solutions Pvt Ltd is a Fastest Growing Tech Company with a talented, passionate and learning team. Techify's DNA Is About Solutions & Technologies. We are here to help our customers grow their business.\nOur Vision is to Become One of the Best Product Engineering companies in India.\nWe put client relationships first hence our mission is to build software solutions that help clients transform their business by unleashing hidden potential with technology.\nSo our success mantra is Customer first, Team second and We are the third.\nOur main focus is our Customers' and Partners' success. Our visionary and experienced team turns innovative ideas into efficient products & softwares. Our well-defined processes ensure on-time delivery to our partners giving us an edge over our competitors. The most important pillar in achieving our goals is our dedicated Team and to encourage them and keep them motivated, we have set up a culture that rewards Self Development and Innovation.\nOur cutting-edge services include intensive research and analysis to identify the appropriate technology to achieve best performances by incurring least cost possible. We take a studied approach towards cost, performance, feature trade-offs to help companies surmount the challenges of delivering high-quality, timely products and services to the marketplace. We have the ability to take up any product be it at the stage of defining, designing, verifying or realizing."
    },
    {
        "Job Title": "Full Stack Developer",
        "Company": "Elsner Technologies Pvt. Ltd.",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "Level": "Mid-Senior level",
        "Experience Years": "2-5 years",
        "Qualification": "Any Graduate",
        "Working Days": "5",
        "About the job": "We are looking for a highly skilled Full Stack Developer with strong expertise in React.js and Node.js. The ideal candidate will have a passion for building performant, scalable web applications and a deep understanding of modern front-end and back-end technologies.",
        "Front-End Responsibilities": [
            "Strong proficiency in React.js and its core principles.",
            "Extensive experience with TypeScript and class components.",
            "Familiarity with RESTful APIs and asynchronous request handling using tools like Postman.",
            "Proficient understanding of web markup, including HTML5 and CSS3.",
            "Basic knowledge of testing libraries and ability to write test cases using Jest, Enzyme, or similar frameworks.",
            "Experience with front-end build tools such as Babel, Webpack, and NPM.",
            "Ability to write clean, maintainable, and reusable code.",
            "Strong problem-solving skills and attention to detail.",
            "Excellent communication and teamwork skills."
        ],
        "Back-End Responsibilities": [
            "Solid experience in developing back-end applications using Node.js and Express.js.",
            "Good understanding of JavaScript/TypeScript on the server-side.",
            "Experience with MongoDB or other NoSQL databases; knowledge of Mongoose is a plus.",
            "Familiarity with authentication mechanisms (JWT, OAuth, etc.).",
            "Ability to design and implement scalable RESTful APIs and handle middleware effectively.",
            "Understanding of asynchronous programming, event-driven architecture, and error handling in Node.js.",
            "Experience with tools like Nodemon, ESLint, and PM2 for development and deployment."
        ],
        "About the company": "Founded in 2006, Elsner Technologies is a global IT solutions company dedicated to helping businesses of all sizes thrive in the digital age. We offer a comprehensive range of services, including:",
        "Company Services": [
            "E-Commerce Solutions: Leverage the power of Magento, Shopify, WooCommerce, BigCommerce, Shopline, Adobe Commerce and much more for a seamless and scalable online shopping experience.",
            "Web Development & Design: Create user-friendly websites and e-commerce platforms powered by popular CMS like WordPress and Magento.",
            "Superior UI/UX Design: Craft intuitive and user-friendly interfaces and experiences.",
            "Mobile App Development: Design and build engaging mobile apps for iOS, Android, or cross-platform compatibility.",
            "Digital Marketing: Reach your target audience and drive results through SEO, PPC, and social media marketing campaigns.",
            "Branding & Creative Design: Develop a strong brand identity that resonates with your audience.",
            "Ongoing Support & Maintenance: Ensure your digital assets remain secure, updated, and performant."
        ],
        "What sets us apart": [
            "Experienced team: We have a strong team of more than 250 certified developers with extensive knowledge and expertise.",
            "Client-focused approach: We take the time to understand your unique needs and goals and tailor our solutions accordingly.",
            "Measurable results: We track and analyze data to ensure your digital initiatives deliver the results you deserve.",
            "Reliable support: We offer 24/7 support to ensure your peace of mind."
        ]
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Type": "Full-time, Contractual Remote Work",
        "Experience Level": "Entry level to Industry Experts",
        "About the job": "Are you passionate about coding and eager to work on cutting-edge projects?\n\nA US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes).",
            "Note: Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        ],
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems.\n\nTuring helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities in thinking, reasoning, coding, agentic behavior, multimodality, multilinguality, STEM and frontier knowledge; and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies.\n\nPowering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance. ALAN also accelerates workflows for model and agent evals, supervised fine-tuning, reinforcement learning, reinforcement learning with human feedback, preference-pair generation, benchmarking, data capture for pre-training, post-training, and building AI applications."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Experience Level": "Entry level (open to all levels)",
        "About the job": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes)."
        ],
        "Note": "Shortlisted candidates may be required to complete a coding assessment as part of the selection process.",
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities... and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers... orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Experience Level": "Entry level (Open to applicants of all levels, from junior to industry experts)",
        "About the job": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes)."
        ],
        "Note": "Shortlisted candidates may be required to complete a coding assessment as part of the selection process.",
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities; and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance. Turing is based in San Francisco, California."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": "Full-time, Contractual Opportunity",
        "About the Job": "A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "Responsibilities": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "Requirements": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "Benefits": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes).",
            "Note: Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        ],
        "About the Company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities... and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": [
            "Full-time",
            "Contractual"
        ],
        "Experience Level": "Open to applicants of all levels, from junior to industry experts.",
        "About the Role": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes).",
            "Note: Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        ],
        "About the Company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers by working with leading AI labs and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance. Turing is based in San Francisco, California."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Employment Type": "Full-time, Entry level",
        "About the job": "Are you passionate about coding and eager to work on cutting-edge projects? A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "Responsibilities": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "Requirements": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "Offerings": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes)."
        ],
        "Notes": "Shortlisted candidates may be required to complete a coding assessment as part of the selection process.",
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": "Full-time",
        "Experience Level": "Entry level (Open to all levels)",
        "About the job": "A US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": {
            "Steps": [
                "One technical interview (60 minutes).",
                "One cultural fit and offer discussion (15-30 minutes)."
            ],
            "Note": "Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        },
        "About the company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. Turing helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities... and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies. Powering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance."
    },
    {
        "Job Title": "Remote Full-Stack Developer",
        "Company": "Turing",
        "Location": "Remote (India)",
        "Job Type": "Full-time, Contractual",
        "Experience Level": "Open to all levels (Entry level to Expert)",
        "About the Role": "Are you passionate about coding and eager to work on cutting-edge projects?\n\nA US-based client is looking for experienced developers with strong JavaScript or TypeScript skills to join their dynamic team. This role offers the opportunity to collaborate with global companies on AI-driven solutions, tackle complex challenges, and continuously enhance your skills in a fast-paced environment.",
        "What You'll Do": [
            "Write clean, reusable, and maintainable code.",
            "Participate in code reviews to ensure high-quality standards.",
            "Develop scalable, modular web applications with a focus on security and stability.",
            "Collaborate with teams to build advanced AI-driven solutions.",
            "Deliver well-structured and documented code."
        ],
        "What We're Looking For": [
            "Open to applicants of all levels, from junior to industry experts.",
            "Bachelor's or Master's degree in Computer Science, Engineering, or equivalent experience.",
            "Strong understanding of ES6 and frameworks like Node.js or React.",
            "Knowledge of front-end, back-end, or full-stack development.",
            "Interest in building scalable, secure web applications with clean architecture.",
            "Good spoken and written communication skills in English."
        ],
        "Nice To Have": [
            "Familiarity with additional frameworks like Vue.js, Angular, or Nest.js.",
            "Understanding of software quality assurance and test planning."
        ],
        "What We Offer": [
            "Work with leading experts worldwide and expand your professional network.",
            "This is a contractual remote work opportunity without traditional job constraints.",
            "Competitive salary based on global industry standards.",
            "Exposure to innovative projects at the forefront of technology."
        ],
        "Interview Process": [
            "One technical interview (60 minutes).",
            "One cultural fit and offer discussion (15-30 minutes).",
            "Note: Shortlisted candidates may be required to complete a coding assessment as part of the selection process."
        ],
        "About the Company": "Turing is one of the world's fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems.\n\nTuring helps customers in two ways: Working with the world's leading AI labs to advance frontier model capabilities... and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies.\n\nPowering this growth is Turing's talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance."
    },
    {
        "Job Title": "Senior Full Stack Developer (Python, JavaScript, AWS, Cloud Services, Azure)",
        "Company": "S&P Global",
        "Location": "On-site, Ahmedabad, Gujarat, India",
        "Job Type": "Full-time",
        "About The Role": {
            "The Team": "S&P Global is a global market leader in providing information, analytics and solutions for industries and markets that drive economies worldwide. The Market Intelligence (MI) division is the largest division within the company. This is an opportunity to join the MI Data and Research's Data Science Team which is dedicated to developing cutting-edge Data Science and Generative AI solutions. We are a dynamic group that thrives on innovation and collaboration, working together to push the boundaries of technology and deliver impactful solutions. Our team values inclusivity, continuous learning, and the sharing of knowledge to enhance our collective expertise."
        },
        "Responsibilities And Impact": [
            "Develop and productionize cloud-based services and full-stack applications utilizing NLP solutions, including GenAI models.",
            "Implement and manage CI/CD pipelines to ensure efficient and reliable software delivery.",
            "Automate cloud infrastructure using Terraform.",
            "Write unit tests, integration tests and performance tests",
            "Work in a team environment using agile practices",
            "Support administration of Data Science experimentation environment including AWS Sagemaker and Nvidia GPU servers",
            "Monitor and optimize application performance and infrastructure costs.",
            "Collaborate with data scientists and other developers to integrate and deploy data science models into production environments",
            "Educate others to improve and coding standards, code quality and test coverage, documentation",
            "Work closely with cross-functional teams to ensure seamless integration and operation of services."
        ],
        "What We're Looking For": {
            "Basic Required Qualifications": [
                "5-8 years of experience in software engineering",
                "Proficiency in Python and JavaScript for full-stack development.",
                "Experience in writing and maintaining high quality code – utilizing techniques like unit testing and code reviews",
                "Strong understanding of object-oriented design and programming concepts",
                "Strong experience with AWS cloud services, including EKS, Lambda, and S3.",
                "Knowledge of Docker containers and orchestration tools including Kubernetes",
                "Experience with monitoring, logging, and tracing tools (e.g., Datadog, Kibana, Grafana).",
                "Knowledge of message queues and event-driven architectures (e.g., AWS SQS, Kafka).",
                "Experience with CI/CD pipelines in Azure DevOps and GitHub Actions."
            ],
            "Additional Preferred Qualifications": [
                "Experience writing front-end web applications using Javascript and React",
                "Familiarity with infrastructure as code (IaC) using Terraform.",
                "Experience in Azure or GPC cloud services",
                "Proficiency in C# or Java",
                "Experience with SQL and NoSQL databases",
                "Knowledge of Machine Learning concepts",
                "Experience with Large Language Models"
            ]
        },
        "About S&P Global Market Intelligence": "At S&P Global Market Intelligence, a division of S&P Global we understand the importance of accurate, deep and insightful information. Our team of experts delivers unrivaled insights and leading data and technology solutions, partnering with customers to expand their perspective, operate with confidence, and make decisions with conviction. For more information, visit www.spglobal.com/marketintelligence.",
        "What's In It For You?": {
            "Our Purpose": "Progress is not a self-starter. It requires a catalyst to be set in motion. Information, imagination, people, technology–the right combination can unlock possibility and change the world. Our world is in transition and getting more complex by the day. We push past expected observations and seek out new levels of understanding so that we can help companies, governments and individuals make an impact on tomorrow. At S&P Global we transform data into Essential Intelligence®, pinpointing risks and opening possibilities. We Accelerate Progress.",
            "Our People": "We're more than 35,000 strong worldwide—so we're able to understand nuances while having a broad perspective. Our team is driven by curiosity and a shared belief that Essential Intelligence can help build a more prosperous future for us all. From finding new ways to measure sustainability to analyzing energy transition across the supply chain to building workflow solutions that make it easy to tap into insight and apply it. We are changing the way people see things and empowering them to make an impact on the world we live in. We're committed to a more equitable future and to helping our customers find new, sustainable ways of doing business. We're constantly seeking new solutions that have progress in mind. Join us and help create the critical insights that truly make a difference.",
            "Our Values": [
                "Integrity",
                "Discovery",
                "Partnership"
            ],
            "Benefits": [
                "Health & Wellness: Health care coverage designed for the mind and body.",
                "Flexible Downtime: Generous time off helps keep you energized for your time on.",
                "Continuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.",
                "Invest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.",
                "Family Friendly Perks: It's not just about you. S&P Global has perks for your partners and little ones, too, with some best-in class benefits for families.",
                "Beyond the Basics: From retail discounts to referral incentive awards—small perks can make a big difference."
            ]
        },
        "Global Hiring And Opportunity At S&P Global": "At S&P Global, we are committed to fostering a connected and engaged workplace where all individuals have access to opportunities based on their skills, experience, and contributions. Our hiring practices emphasize fairness, transparency, and merit, ensuring that we attract and retain top talent. By valuing different perspectives and promoting a culture of respect and collaboration, we drive innovation and power global markets."
    },
    {
        "Job Title": "Full Stack Developer (Back End Specialization)",
        "Company": "InRisk Labs",
        "Location": "Ahmedabad, Gujarat, India (On-site)",
        "Job Type": "Full-time",
        "About the Company": "InRisk Labs is redefining the way risk is actively managed through Smart Index Insurance solutions. By leveraging cutting-edge tech, we are committed to providing a proactive, data-driven methodology for assessing and mitigating the adverse impacts of climate, market volatility, calamities, and other extreme events.",
        "Position Overview": "We are looking for a Full Stack Developer specializing in back-end technologies such as Python, Go, and cloud architecture. You will design, build, and maintain secure, scalable cloud platforms and applications that support data-driven climate risk solutions. This role focuses on efficient back-end services and managing cloud infrastructure while collaborating with cross-functional teams to deliver impactful insurance products.",
        "Key Responsibilities": [
            "Design and implement secure, scalable server-side logic using Python and Go.",
            "Develop, deploy, and manage cloud-based infrastructure (AWS, Azure, or GCP) for high availability and scalability.",
            "Build and maintain robust RESTful and GraphQL APIs for seamless data integration and retrieval.",
            "Design and optimize relational and NoSQL databases for large-scale, real-time datasets.",
            "Contribute to front-end integration for seamless communication between systems.",
            "Ensure high-quality code through testing, reviews, and adherence to best practices.",
            "Stay updated with advancements in back-end and cloud technologies to drive system improvements."
        ],
        "Qualifications": {
            "Education": "Bachelor's or Master's degree in Computer Science, Software Engineering, or related field, preferably from IITs or NITs.",
            "Experience": "2+ years of experience in full stack development with a focus on back-end and cloud technologies.",
            "Technical Skills": [
                "Expertise in Python and Go for back-end development.",
                "Proficiency in architecting and managing cloud platforms (AWS, Azure, or GCP).",
                "Experience with APIs (REST/GraphQL) and containerization tools (Docker, Kubernetes).",
                "Strong knowledge of relational and NoSQL databases (MySQL, PostgreSQL, MongoDB)."
            ]
        }
    },
    {
        "Job Title": "Full-stack Developer",
        "Company": "Uplers (working for client Serenity)",
        "Location": "Remote (India)",
        "Job Type": "Full Time Permanent position",
        "Payroll and Compliance": "managed by Serenity via Uplers",
        "Experience Level": "Mid-Senior level (2.00 + years)",
        "Salary": "INR 3000000-6000000 / year (based on experience)",
        "Shift": "(GMT+05:30) Asia/Kolkata (IST)",
        "Expected Notice Period": "30 Days",
        "About Serenity (Uplers' Client)": "Seeking a skilled Full-stack Developer to join our team in building cutting-edge blockchain solutions for secure data storage and security. As a Full-stack Developer, you will be a key contributor to both front-end and back-end development, seamlessly integrating blockchain technologies to deliver scalable, secure, and user-friendly platforms. These platforms will meet the demands of the modern digital landscape and set new industry standards for privacy and asset management.",
        "Responsibilities": [
            "Design and develop responsive front-end interfaces using modern JavaScript frameworks.",
            "Build and maintain back-end APIs and services to support DApp functionality.",
            "Write, test, and deploy smart contracts on the EVM-compatible blockchains.",
            "Ensure the security and performance of applications through rigorous testing and optimization.",
            "Collaborate with cross-functional teams to define, design, and ship new features.",
            "Participate in code reviews and maintain high-quality coding standards.",
            "Developing intuitive and responsive user interfaces that facilitate seamless interaction with blockchain-based systems.",
            "Integrating cutting-edge cryptographic protocols and privacy-enhancing techniques into the core infrastructure.",
            "Collaborating with a multidisciplinary team of engineers, cryptographers, and designers to push the boundaries of blockchain technology.",
            "Staying abreast of emerging trends and advancements in the blockchain and privacy domains."
        ],
        "Required Skills": [
            "Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).",
            "A deep understanding of blockchain architecture, consensus mechanisms, and smart contract development.",
            "Proven experience as a Full-stack Developer or similar role.",
            "Proficiency in multiple programming languages, including Solidity, JavaScript, Python and front-end frameworks (e.g., React, Vue.js, or Angular).",
            "Strong back-end development skills with Node.js and familiarity with Express or similar frameworks.",
            "Experience with blockchain development, including Rust (for CosmWasm on Secret Network) and/or Solidity (for EVM chains).",
            "Knowledge of Web3 libraries (e.g., Web3.js, ethers.js, CosmJS) for blockchain integration.",
            "Understanding of security best practices in web and blockchain development.",
            "Excellent problem-solving skills and attention to detail."
        ],
        "Must have skills mentioned separately": [
            "CI/CD",
            "Nft",
            "Rust",
            "Web3auth",
            "Blockchain",
            "dapps",
            "Smart Contract",
            "web3.js",
            "Docker",
            "Solidity"
        ],
        "Preferred Skills": [
            "Experience with various blockchain ecosystems for development.",
            "Familiarity with decentralized identity solutions (e.g., Web3Auth) and NFT implementation.",
            "Knowledge of DevOps practices, such as CI/CD pipelines and containerization (e.g., Docker).",
            "Prior work on privacy-focused or data storage applications."
        ],
        "Interview Process": [
            "Technical Round 1",
            "Assessment",
            "Technical Round 2"
        ],
        "About Uplers (Hiring Platform)": "Our goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement.",
        "How to apply for this opportunity": [
            "Step 1: Click On Apply! And Register or Login on our portal.",
            "Step 2: Complete the Screening Form & Upload updated Resume",
            "Step 3: Increase your chances to get shortlisted & meet the client for the Interview!"
        ]
    }
]